{"sections":{"16551025613574700f":{"type":"condition-first-screen","blocks":{"1655102561d73858e3-0":{"type":"highlight","settings":{"image":"shopify:\/\/shop_images\/Calendar.png","title":"Same-day delviery"}},"cd8123a0-09df-4259-a1b0-19855695ee73":{"type":"highlight","settings":{"image":"shopify:\/\/shop_images\/Icon_2.png","title":"Order From Home"}},"7f23422c-8cc1-4df2-9b17-83c563cccdbb":{"type":"highlight","settings":{"image":"shopify:\/\/shop_images\/Shield_Done.png","title":"Medication anytime, anywhere"}},"a1715dd4-6a5f-46b4-88d9-413158ee61d3":{"type":"highlight","settings":{"image":"shopify:\/\/shop_images\/Icon_1.png","title":"Prescribed by trusted NHS GPs"}}},"block_order":["1655102561d73858e3-0","cd8123a0-09df-4259-a1b0-19855695ee73","7f23422c-8cc1-4df2-9b17-83c563cccdbb","a1715dd4-6a5f-46b4-88d9-413158ee61d3"],"settings":{"image_background":"shopify:\/\/shop_images\/hero-bg.png","image_photo":"shopify:\/\/shop_images\/woman-doctor-wearing-lab-coat-with-stethoscope-isolated.jpg","title":"Repeat NHS Prescriptions","button_label":"Order Prescription","button_link":"https:\/\/welzo.com\/pages\/contact","subtitle":"<p>From the comfort of your home, order your NHS repeat prescriptions online from a trusted pharmacy to your door with us at Welzo.<\/p>","padding_top":72,"padding_bottom":100}},"1654882863972c1789":{"type":"how-it-works","blocks":{"1654882863ffb91eb0-0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/how1.png","title":"Order online","text":"<p>Head to Welzo with your NHS login, find your repeat prescription and place an order. Welzo will then do the heavy lifting and carefully process your order for you.  <\/p>","link_label":"","link":""}},"04b8aba9-75af-42a8-96eb-d171fda483a0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/how4_550x_7533ae74-881a-47f4-b6a0-408572a5697b.webp","title":"GP confirmation","text":"<p>We will then speak to the GP about your request. Once it is confirmed, we'll get an electronic copy of your prescription. <\/p>","link_label":"","link":""}},"0ba8c806-ec12-4071-8ea8-20a869e97b5f":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/how6_256x256_86d92080-b58c-46f6-8998-4648543b2e5f.webp","title":"Express Delivery","text":"<p>Once confirmed. We'll deliver it to you for free on the same day, or you can pick it up from your chosen location. <br\/><\/p>","link_label":"","link":""}}},"block_order":["1654882863ffb91eb0-0","04b8aba9-75af-42a8-96eb-d171fda483a0","0ba8c806-ec12-4071-8ea8-20a869e97b5f"],"settings":{"title":"How to order online","image_width":"half","image_ratio":"adapt","column_alignment":"center","background_style":"none","button_label":"","button_link":"","swipe_on_mobile":false,"color_scheme":"background-1","padding_top":68,"padding_bottom":68}},"1f08dc2b-8329-4db6-8d08-22d1044009a0":{"type":"health","settings":{"image_photo":"shopify:\/\/shop_images\/closeup-woman-lying-bed-playing-smartphone-bed-online-shopping-social-technology-communication_1.jpg","is_left":false,"title":"Everything's covered","text":"<p>With Welzo's online NHS repeat prescription service, you will get to make the decisions. You can order anytime and anywhere, making it fully assceable to everyone. <br\/><br\/>Through us, you can skip the step of booking an appointment to speak to a GP. We'll sort out your prescription for you. Just tell us what you need and when. <br\/><br\/>Welzo will send your prescription to the GP for approval and then deliever for you.<br\/><\/p>","padding_top":36,"padding_bottom":36}},"a6f1baed-aa71-451c-a2e8-fdd4cb729c06":{"type":"health","settings":{"image_photo":"shopify:\/\/shop_images\/pexels-karolina-grabowska-7195084.jpg","is_left":true,"title":"The Family's covered","text":"<p>Welzo has the whole family covered. If you have a family member or friend who has an NHS repeat prescription, you can order online for them. <br\/><br\/>If they are over the age of 16, you can with their consent, order for them. Place the order under your name and put down their details. Welzo will then get your loved on their medication. <br\/><\/p><p><\/p>","padding_top":36,"padding_bottom":36}},"0620a3cb-48e1-4a17-8d00-b42f4546d0dd":{"type":"health","settings":{"image_photo":"shopify:\/\/shop_images\/pexels-greta-hoffman-7674831_2.jpg","is_left":false,"title":"Trusted partner","text":"<p>We are a partner of the NHS with a full roaster of trusted NHS trained doctors. Once you have placed your prescription order, it goes straight to the GP to process. When Welzo receives approval from the GP, we'll provide you with your repeat prescription. Welzo will handle your order descreatly and efficently. <br\/><br\/>Welzo has a wide range of medicines and provides you with the best service all around the clock. You can then have your order delievered to you on the same day or you can it delievered to a place of your choosing.<\/p>","padding_top":36,"padding_bottom":36}},"1196ecde-6893-44ba-8371-65926c594fc8":{"type":"health","settings":{"image_photo":"shopify:\/\/shop_images\/pexels-karolina-grabowska-4506075.jpg","is_left":true,"title":"Referrals","text":"<p>Our NHS-trained doctors can provide you with referrals for external treatments with specialised medical practitioners. <\/p><p>A referral may be provided if your concern requires specialised support. You and your GP can work together to determine if your concern can be treated without the need for a specialist. <\/p><p>They will evaluate if it is clinically necessary in your case to be referred to a specialist in a particular field.<\/p>","padding_top":36,"padding_bottom":36}},"4dc083d5-ecd6-4e13-a73e-f641102dbbf5":{"type":"health","settings":{"image_photo":"shopify:\/\/shop_images\/pexels-ekaterina-bolovtsova-4047811.jpg","is_left":false,"title":"Online Solutions","text":"<p>Online healthcare comes with a range of benefits. You are able to not only choose a time and place for your appointment but you can also have any necessary blood tests, prescriptions or products sent right to your door immediately after your session. <\/p><p>With Welzo, you can take your health back into your own hands. Similarly, if you or someone you care for needs urgent advice, a Welzo doctor is only a few clicks away!<\/p>","padding_top":36,"padding_bottom":36}},"c5ba089b-7587-457e-bfb1-70625c46b92f":{"type":"experts-opinion","settings":{"image_background":"shopify:\/\/shop_images\/bg_c89961da-bec1-4c3d-a253-63fb22b486ac.webp","image_expert":"shopify:\/\/shop_images\/medium-shot-woman-holding-smartphone.jpg","title":"Immediate Healthcare at Home","text":"<p>\"I love the convenience of ordering my repeat prescriptions online\"<\/p>","name":"Samantha Burgess","profession":"Welzo Customer","color_scheme":"background-1","padding_top":40,"padding_bottom":52}},"16551130536833201e":{"type":"condition-info","blocks":{"1655113053d56037c8-0":{"type":"column","settings":{"title":"The Welzo Difference","text":"<p>Why is Welzo the best option? Here's why...<\/p>"}},"2a0daa2f-19dd-41b4-8739-d30c9695e07e":{"type":"column","settings":{"title":"How does it work?","text":"<p>Unlike other online GP services, Welzo doesn't limit your appointment to just one concern. In your 15-minute session, our qualified doctors can assist you with any problem you need help with - at no extra cost! Then, if you require medication, the Welzo online pharmacy can have it sent to your door with our same or next-day delivery to most areas of the UK!<\/p>"}},"2445b395-2ff1-4324-9afd-874e3d14e502":{"type":"card","settings":{"image":"shopify:\/\/shop_images\/learn-more-bg-1.png","percent":26,"title":"of NHS patients found it too difficult to make an appointment","text":"<p>According to the 2022 national NHS survey, 26.5% of patients who needed an appointment said they had avoided making one in the last 12 months as they found it too difficult.<\/p>"}},"e309db4d-7787-4080-8d22-91966f9a4344":{"type":"card","settings":{"image":"shopify:\/\/shop_images\/hero-article-bg.png","percent":51,"title":"of people got an appointment at a time they wanted or sooner","text":"<p>According to the NHS GP patient survey findings, only 51.2% of people got an appointment at the time they wanted or sooner.<\/p>"}},"0b32063e-2d50-46c7-9764-7937a24e9240":{"type":"column","settings":{"title":"When should you book?","text":"<p>You should book an online GP appointment when you are experiencing a health problem, especially if the problem is new or unusual. A GP can help to determine if the issue is likely to require additional support, such as testing or medication.<\/p>"}},"e9096502-ccb3-453c-af9b-c0b223a69fc0":{"type":"card","settings":{"image":"shopify:\/\/shop_images\/pinkbackground.webp","percent":55,"title":"of those surveyed have used an online GP service in the last 12 months","text":"<p>According to the 2022 NHS survey, overall, 55.1% of users had used at least one online general practice service in the 12 months before taking part in the survey.<\/p>"}}},"block_order":["1655113053d56037c8-0","2a0daa2f-19dd-41b4-8739-d30c9695e07e","2445b395-2ff1-4324-9afd-874e3d14e502","e309db4d-7787-4080-8d22-91966f9a4344","0b32063e-2d50-46c7-9764-7937a24e9240","e9096502-ccb3-453c-af9b-c0b223a69fc0"],"settings":{"padding_top":100,"padding_bottom":0}},"16548828115edf2d35":{"type":"experts-opinion","settings":{"image_background":"shopify:\/\/shop_images\/hero-mob-bg-2.png","image_expert":"shopify:\/\/shop_images\/portrait-cheerful-healthcare-worker-white-coat-pharmaceutical-store.jpg","title":"Hear from one of our pharmacists!","text":"<p>\"Repeat prescriptions can be easy to forget. That's why we're here to ensure you receive your medication when you need it.\"<\/p>","name":"Welzo Experts","profession":"","color_scheme":"background-1","padding_top":100,"padding_bottom":100}},"1654883326cbc635d6":{"type":"faq","blocks":{"1654883326a8696fa9-0":{"type":"column","settings":{"title":"Can I get a prescription from a Welzo online consultation?","text":"<p>Our NHS-trained doctors can recommend a suitable medication for you, which can be ordered from our Welzo online pharmacy immediately after your consultation.<\/p><p>The Welzo online pharmacy requires a short online consultation that will determine if you are suitable for a specific medication before you are able to purchase it. These consultations have been crafted by doctors and are able to decide based on your personal information, medical history and current concerns if you are eligible for a prescription. <\/p>"}},"aff0457f-d9c6-444a-8021-93115fdc21d7":{"type":"column","settings":{"title":"Can Welzo give me a referral for secondary care?","text":"<p>Yes, if during your consultation, our doctors believe that you require further care, they can provide you with a referral. <\/p><p>Referrals are generally only given to those who have already tried treatments and testing provided by a GP. If you are concerned that your ongoing treatments are not providing adequate support, speak to your GP about further options. <\/p>"}},"b2906c82-3d97-4fe9-9a2c-6d52a98451eb":{"type":"column","settings":{"title":"Can I get a sick note from Welzo?","text":"<p>Yes, we can provide a sick note to those whose employers require a doctor's note to be eligible for sick leave. <\/p><p>You may be asked about the time you have already taken off due to sickness. This is because the government requires that you give your employer a fit\/sick note if you have been ill for longer than 7 days in a row and have taken sick leave. This includes non-working days, such as weekends and bank holidays.<\/p>"}},"d7537715-5b63-43ed-aaad-97b0c72c4b67":{"type":"column","settings":{"title":"What technology should I use for my appointment?","text":"<p>The Welzo online GP appointments can be accessed from a phone, tablet or computer. Depending on your preference for a phone call or video call, you may require a device with a camera.<\/p>"}},"949e06c0-5f15-40ac-9bfe-08dfacbb150e":{"type":"column","settings":{"title":"How much does it cost per appointment?","text":"<p>A Welzo GP appointment is £49. This price includes any prescriptions, referrals or sick notes that may need to be written during your consultation. <\/p><p>Please note: this will not include the cost of the prescription itself.<\/p>"}},"9cc38b8e-7df1-45dc-8e90-c39b82530bcd":{"type":"column","settings":{"title":"Can I schedule an appointment for my child?","text":"<p>Yes, you are able to schedule an appointment for a dependent aged between 1-16 years. After the age of 16, the individual can schedule and complete their own appointments without the need of a parent or guardian present. <\/p>"}},"a6c251b6-b1c2-4989-b83c-49d2cd2df772":{"type":"column","settings":{"title":"Do you offer immediate or same-day services?","text":"<p>We offer consultations in just 5 minutes! If you wish to have your appointment another time, our GPs are available 24\/7.<\/p><p>You can schedule an appointment at any time of your choosing, whether that be on the same day or in a week. Welzo allows you to cater your appointments to your life. <\/p>"}},"95f35bd1-0670-488b-b1cd-86f32451d9e6":{"type":"column","settings":{"title":"Will Welzo send any information to my GP?","text":"<p>We will not send any information to external sources, including a GP without your consent. <\/p>"}},"9bf8cff8-ce30-4d0b-b03f-1e98714e3551":{"type":"column","settings":{"title":"How long will be appointment be?","text":"<p>Our appointments usually run for 15 minutes. However, if you require additional assistance, our GPs can extend this time to ensure your concerns are attended to.<\/p>"}},"55a6d6cb-6a27-4430-b232-7c3364dfa24c":{"type":"column","settings":{"title":"How is an online consultation different from an in-person appointment?","text":"<p>Unlike in-person appointments, our service allows you to choose a time that works for you. This means you won't be held up in waiting rooms or need to relocate to your doctor's rooms. <\/p><p>An online appointment is ideal if you believe that you may be contagious as you won't need to leave your space to be seen to be a doctor. We recommend that in cases of infection, you schedule an online appointment instead of an in-person appointment as this will keep both you and others safe. <\/p>"}},"fc0edc64-6e4c-48e2-b8e1-fd9712f55f39":{"type":"column","settings":{"title":"Will my GP be able to see my medical history?","text":"<p>No, your GP won't be able to see any external medical records, this includes NHS records. <\/p><p>You may be asked about your medical history during your session. This is to ensure that your doctor has all the information they need to accurately determine your illness and how best to treat you. <\/p>"}},"00f11702-38cd-4df4-b9f4-4a90c421c01f":{"type":"column","settings":{"title":"Are there any conditions that you can't provide advice about?","text":"<p>Yes, we are unable to provide advice if you are experiencing an acute injury or serious painful condition such as:<\/p><p>- Major trauma on any part of your body,<\/p><p>-  Severe chest pain, a suspected heart attack or stroke, <\/p><p>- Head or neck injuries, <\/p><p>- A neurological defect or seizure,<\/p><p>- Sudden or heavy bleeding,<\/p><p>- Pregnancy-related complications<\/p><p>- Severe mental health issues<\/p><p>- Sudden onset of difficulty in breathing, including persistent breathlessness that may be an asthma attack<\/p><p>- Patients currently completing chemotherapy with suspected neutropenia.<\/p><p><\/p><p>If you are experiencing one of the above conditions and require necessary treatment, you should dial 999 for an ambulance when it's safe to do so.<\/p>"}},"20431c7e-0b9e-4f3d-8890-eedc6583f7d1":{"type":"column","settings":{"title":"What happens if I have technical issues during my consultation?","text":"<p>Please get in touch with our customer support team if you have technical issues during your consultation. <\/p>"}},"66cfd088-b037-4a9e-820e-99034e62747a":{"type":"column","settings":{"title":"Can I use a Welzo online consultation in an emergency?","text":"<p>No, this service should not be used in an emergency. <\/p><p>If you, or someone around you, are in need of immediate medical attention, you should call <strong>999<\/strong> as soon as possible.<\/p><p>If you are unsure if your concern is an emergency, call the NHS on <strong>111.<\/strong><\/p>"}}},"block_order":["1654883326a8696fa9-0","aff0457f-d9c6-444a-8021-93115fdc21d7","b2906c82-3d97-4fe9-9a2c-6d52a98451eb","d7537715-5b63-43ed-aaad-97b0c72c4b67","949e06c0-5f15-40ac-9bfe-08dfacbb150e","9cc38b8e-7df1-45dc-8e90-c39b82530bcd","a6c251b6-b1c2-4989-b83c-49d2cd2df772","95f35bd1-0670-488b-b1cd-86f32451d9e6","9bf8cff8-ce30-4d0b-b03f-1e98714e3551","55a6d6cb-6a27-4430-b232-7c3364dfa24c","fc0edc64-6e4c-48e2-b8e1-fd9712f55f39","00f11702-38cd-4df4-b9f4-4a90c421c01f","20431c7e-0b9e-4f3d-8890-eedc6583f7d1","66cfd088-b037-4a9e-820e-99034e62747a"],"settings":{"faq_section_show":true,"title":"Frequently Asked Questions","page_width":1140,"padding_top":100,"padding_bottom":100}},"4b0745e4-2fd7-4d3b-8d80-457f0acc9e04":{"type":"experts-opinion","disabled":true,"settings":{"image_background":"shopify:\/\/shop_images\/bg_c89961da-bec1-4c3d-a253-63fb22b486ac.webp","image_expert":"shopify:\/\/shop_images\/pexels-ketut-subiyanto-4560177.jpg","title":"","text":"<p>Can't find a time to see your GP? Well, Welzo's got you covered. <\/p>","name":"","profession":"","color_scheme":"background-1","padding_top":40,"padding_bottom":52}},"fc92cfe5-40fe-423a-a3d3-8cd0c811517a":{"type":"faq2","blocks":{"359c3187-05b6-4995-aa62-191a44c07949":{"type":"column","settings":{"title":"What is Welzo?","text":"<p>Welzo is an all-in-one online healthcare platform that aims to provide its users with fast, simple and effective alternatives to the current healthcare system. Welzo combines a comprehensive library of medical content, a user-based GP service and a vast online pharmacy, all to ensure people are getting the healthcare they deserve.<\/p>"}},"template--15341737771101__fc92cfe5-40fe-423a-a3d3-8cd0c811517a-16685101373832b34b-0":{"type":"column","settings":{"title":"Why was Welzo started?","text":"<p>Welzo was created becuase the medical industry was falling behind other newly digitised sectors. That's why Welzo was made as a one-stop shop for an individual's healthcare needs. Now you can learn about your concerns from our talented medical writers, speak to healthcare professionals at the click of a button, and be tested and treated for a variety of concerns, all without leaving your front door.<\/p>"}},"eeca106f-54f5-46d3-ae49-9a2c572bce9f":{"type":"column","settings":{"title":"Why should I choose Welzo?","text":"<p>If you're looking for a simplified way of sorting out your medical concerns, Welzo might be just what the doctor ordered. While other companies provide singular services, here at Welzo, we do it all. Our customer portal is a state-of-the-art platform where you are able to view your previous test results, ongoing prescriptions and doctor's comments. If you are looking for immediate answers to your queries, you can browse our Health Hub for popular searched-for medical questions, or book an appointment with a GP and be seen in as little as 5 minutes. <\/p>"}},"60ff4e3a-3c9c-465b-8b8f-0d864a22f4eb":{"type":"column","settings":{"title":"Where is Welzo located?","text":"<p>Welzo is located in London, United Kingdom. Being from one of the busiest cities in the world, we understand how difficult it can be to fit in your health around your full daily life. That's why we've ensured that all of our services can be accessed from the comfort of your home. <\/p>"}}},"block_order":["359c3187-05b6-4995-aa62-191a44c07949","template--15341737771101__fc92cfe5-40fe-423a-a3d3-8cd0c811517a-16685101373832b34b-0","eeca106f-54f5-46d3-ae49-9a2c572bce9f","60ff4e3a-3c9c-465b-8b8f-0d864a22f4eb"],"settings":{"title":"Learn More About Welzo","padding_top":36,"padding_bottom":36}}},"order":["16551025613574700f","1654882863972c1789","1f08dc2b-8329-4db6-8d08-22d1044009a0","a6f1baed-aa71-451c-a2e8-fdd4cb729c06","0620a3cb-48e1-4a17-8d00-b42f4546d0dd","1196ecde-6893-44ba-8371-65926c594fc8","4dc083d5-ecd6-4e13-a73e-f641102dbbf5","c5ba089b-7587-457e-bfb1-70625c46b92f","16551130536833201e","16548828115edf2d35","1654883326cbc635d6","4b0745e4-2fd7-4d3b-8d80-457f0acc9e04","fc92cfe5-40fe-423a-a3d3-8cd0c811517a"]}