{"sections":{"main":{"type":"pre-employment-page","settings":{"padding_top":36,"padding_bottom":36}},"1654875616d39f3567":{"type":"packages-first-screen","settings":{"image_background":"shopify:\/\/shop_images\/hero-mob-bg-2.png","image_photo":"shopify:\/\/shop_images\/doctor-reaches-towards-shelf.jpg","content_vertical_alignment":"top","reviews":true,"title":"Alcohol & Drug Testing","subtitle":"<p>We provide same day and next day alcohol drug testing at clinics across the United Kingdom or conducted at home via our testing kits. <\/p>","button_title":"Contact Us","button_link":"https:\/\/welzo.com\/pages\/contact","padding_top":100,"padding_bottom":100}},"16548756697ecdbbc4":{"type":"packages-info","settings":{"image_background":"shopify:\/\/shop_images\/Group_139.jpg","title":"<p>What is alcohol and drug testing?<\/p>","text1":"<p>Employee alcohol and drug testing is becoming more common in the workplace. Employers may require employees to submit to testing as a condition of employment, or they may test employees who are suspected of being under the influence of drugs or alcohol. Testing may also be done randomly, or after an accident has occurred.<\/p><p><br\/><\/p><p>There are a variety of ways to test for alcohol and drugs, including urine tests, hair tests, blood tests, and breathalyzers. Each type of test has its own advantages and disadvantages.<\/p><p><br\/><\/p><p>Urine tests are the most common type of drug test. They are relatively inexpensive and can detect a wide variety of substances, including alcohol, amphetamines, barbiturates, benzodiazepines, marijuana, cocaine, opiates, and phencyclidine (PCP). Urine tests are generally accurate, but they can be affected by a variety of factors, including the person's metabolism and how much fluid they have consumed.<\/p><p><br\/><\/p><p><\/p>","text2":"<p>Hair tests are less common than urine tests, but they are more expensive. Hair tests can detect drugs that have been used in the past 90 days, and they are not affected by the person's metabolism or fluid intake. However, hair tests can be affected by external factors, such as exposure to secondhand smoke or drug residue.<\/p><p><br\/><\/p><p>Blood tests are the most accurate type of drug test, but they are also the most expensive. Blood tests can detect drugs that have been used in the past 24 hours, and they are not affected by the person's metabolism or fluid intake. However, blood tests can be affected by external factors, such as exposure to secondhand smoke or drug residue.<\/p>","padding_top":100,"padding_bottom":100}},"1654875704034f9569":{"type":"why","blocks":{"165487570462420882-0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon2.png","title":"Easy to track and monitor","text":"<p>Our state of the art employer platform makes monitoring and tracking testing statistics easy and simple.<\/p>"}},"37d52510-7415-4eac-8aec-579f871a286e":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon3.png","title":"Price matched","text":"<p>We price match all of our testing medicals. This guarantees we are the most affordable on the market. <\/p>"}},"75fa2fd9-fbaf-4a22-8123-d41929802ebd":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon4.png","title":"Efficient and Fast","text":"<p>We offer same day appointments and express results through our dedicated employer hotline that is open 7 days a week. <\/p>"}}},"block_order":["165487570462420882-0","37d52510-7415-4eac-8aec-579f871a286e","75fa2fd9-fbaf-4a22-8123-d41929802ebd"],"settings":{"image_background":"shopify:\/\/shop_images\/hero-mob-bg-2.png","title":"We Are The UK's Leading Testing Provider","padding_top":100,"padding_bottom":100}},"1654875933fdddff77":{"type":"faq","blocks":{"16548759333a7fc787-0":{"type":"column","settings":{"title":"Why do some employers request alcohol and drug tests?","text":"<p>There are a variety of reasons why employers may require alcohol and blood testing for their employees. In some cases, it may be a condition of employment. In other cases, it may be required in order to comply with safety regulations or company policy.<\/p><p><br\/><\/p><p>Alcohol and blood testing can help to ensure that employees are not under the influence of alcohol while on the job. This is important for a variety of reasons, including safety concerns and potential liability issues.<\/p>"}},"816d3c88-b735-4f19-86c6-40d3b028d0e0":{"type":"column","settings":{"title":"How do you take a alcohol blood test?","text":"<p>There are two ways to take an alcohol and blood test. The first way is to have a doctor or nurse draw your blood. This is called a venipuncture. The second way is to use a finger prick device. This is called a capillary puncture. Alcohol and blood tests are used to measure the amount of alcohol in your blood. They are also used to measure your blood alcohol content (BAC).<\/p>"}},"4b4ce8ab-21b8-459b-8a7e-65c15878a89f":{"type":"column","settings":{"title":"How long do results take?","text":"<p>The results of a drug test can take a few days to come back. If the results are positive, it means that you have drugs in your system. If the results are negative, it means that you do not have drugs in your system.<\/p>"}},"1e6b2df1-8e55-4ac5-9003-35ca3ab89af3":{"type":"column","disabled":true,"settings":{"title":"Are these medicals authorised for work abroad?","text":"<p>Yes we work with GMC registered doctors and all of them are registered with the FCO. <\/p>"}},"710be9ac-fc12-4e2c-bcf1-77578f19a6e1":{"type":"column","disabled":true,"settings":{"title":"What tests are carried out with the medical?","text":"<p>The tests carried out depend on the country you are travelling to. Each country has its own set of testing requirements, but we are aware of the conditions and will make sure that they comply. These tests usually involve a consultation with our doctors to check your ear, sight, and chest, followed by blood work and potentially an x-ray.<\/p>"}}},"block_order":["16548759333a7fc787-0","816d3c88-b735-4f19-86c6-40d3b028d0e0","4b4ce8ab-21b8-459b-8a7e-65c15878a89f","1e6b2df1-8e55-4ac5-9003-35ca3ab89af3","710be9ac-fc12-4e2c-bcf1-77578f19a6e1"],"settings":{"title":"Frequently Asked Questions","padding_top":100,"padding_bottom":100}}},"order":["main","1654875616d39f3567","16548756697ecdbbc4","1654875704034f9569","1654875933fdddff77"]}