{"sections":{"main":{"type":"pre-employment-page","settings":{"padding_top":36,"padding_bottom":36}},"1654875616d39f3567":{"type":"packages-first-screen","settings":{"image_background":"shopify:\/\/shop_images\/hero-mob-bg-2.png","image_photo":"shopify:\/\/shop_images\/flying-spain-flag.jpg","content_vertical_alignment":"top","reviews":true,"title":"Spanish Visa Medical","subtitle":"<p>Affordable and same day Spanish embassy medical certificates. We are an authorised provider of embassy visa medicals.<\/p><p>Attend our clinic: 170 Vauxhall Bridge Rd, London SW1V 1DX <\/p>","button_title":"Book now","button_link":"https:\/\/app.squarespacescheduling.com\/schedule.php?owner=25553454&appointmentType=41852584¬embedded=1","show_logos":true,"title_news":"","padding_top":100,"padding_bottom":100}},"3e7b8001-6fd0-4102-a5be-dfc24e13a930":{"type":"how2","settings":{"image_background":"shopify:\/\/shop_images\/IMAGE_e3c78f08-4a2b-4405-8f60-eb294079cbc9.png","title":"How it works","title1":"Book time online","text1":"<p>Select a time online for your Spanish medical appointment.<\/p>","title2":"Attend our clinic","text2":"<p>Attend our London, Victoria test centre where you will have a consultation with one of our doctors. This will take between 20-30minutes.<\/p>","title3":"Recieve medical certificate","text3":"<p>Once we have reviewed you application and results, we will issue you with a certificate for your Spanish medical usually in 2 - 3 days. <\/p>","padding_top":36,"padding_bottom":36}},"16548756697ecdbbc4":{"type":"packages-info","settings":{"image_background":"shopify:\/\/shop_images\/Group_139.jpg","title":"<p>What Is a Spanish embassy medical certificate?<\/p>","text1":"<p>Once you have your Spanish visa, you will need to go through a medical examination. This is required for all foreigners who want to stay in Spain for more than three months.<\/p><p><br\/><\/p><p>The medical examination must be done within 30 days of your arrival in Spain. You will need to bring your passport, residency permit, and travel insurance policy to the appointment.<\/p><p><br\/><\/p><p>During the medical examination, a doctor will check your general health and make sure you are up-to-date on all your vaccinations. They will also test for HIV and other infectious diseases.<\/p><p><br\/><\/p><p>After the medical examination, you will receive a certificate that says you are healthy and fit to live in Spain. Make sure to keep this certificate with your other important documents.<\/p><p><\/p>","text2":"<p>If you have any medical conditions that require treatment, you may need to get a special permit from the Spanish government. This permit will allow you to get the medical care you need while you are living in Spain.<\/p><p><\/p><p>The Spanish government requires all foreigners who want to live in Spain for more than three months to have a medical examination. This is required in order to make sure that you are healthy and fit to live in Spain. You will need to bring your passport, residency permit, and travel insurance policy to the appointment. During the medical examination, a doctor will check your general health and make sure you are up-to-date on all your vaccinations. They will also test for HIV and other infectious diseases. <\/p><p>After the medical examination, you will receive a certificate that says you are healthy and fit to live in Spain. Make sure to keep this certificate with your other important documents. If you have any medical conditions that require treatment, you may need to get a special permit from the Spanish government. This permit will allow you to get the medical care you need while you are living in Spain. <\/p>","padding_top":100,"padding_bottom":100}},"1654875704034f9569":{"type":"why","blocks":{"165487570462420882-0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon2.png","title":"Authorised by embassies","text":"<p>Welzo only works with verified doctors and clinics authorised by embassies such as Harley Medic International.<\/p>"}},"37d52510-7415-4eac-8aec-579f871a286e":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon3.png","title":"Price matched","text":"<p>We price match all of our visa medicals. This guarantees we are the most affordable on the market. <\/p>"}},"75fa2fd9-fbaf-4a22-8123-d41929802ebd":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon4.png","title":"Efficient and Fast","text":"<p>We offer same day appointments and express results and certificate for visa issuance. <\/p>"}}},"block_order":["165487570462420882-0","37d52510-7415-4eac-8aec-579f871a286e","75fa2fd9-fbaf-4a22-8123-d41929802ebd"],"settings":{"image_background":"shopify:\/\/shop_images\/hero-mob-bg-2.png","title":"We Are The UK's Leading Visa Medical Provider","padding_top":100,"padding_bottom":100}},"1654875933fdddff77":{"type":"faq","blocks":{"16548759333a7fc787-0":{"type":"column","settings":{"title":"Where can I book my visa medical?","text":"<p>Booking a visa medical is a straightforward process. Simply head to the <a href=\"https:\/\/welzo.com\/pages\/contact\" title=\"https:\/\/welzo.com\/pages\/contact\">contact us<\/a> page by clicking here. Once you complete the contact us form, we will get in touch with you via email within 30 minutes to organise your appointment.<\/p>"}},"816d3c88-b735-4f19-86c6-40d3b028d0e0":{"type":"column","settings":{"title":"How much does a Spanish work medical cost?","text":"<p>We offer the most affordable visa medicals on the market. Prices usually start from as low as £49 all the way up to £250 depending on the requirements for your travel destination.<\/p>"}},"4b4ce8ab-21b8-459b-8a7e-65c15878a89f":{"type":"column","settings":{"title":"How long does a Spanish medical take?","text":"<p>Depending on your travel destination, the condition for your visa medical will vary. However, the average appointment time is 30 minutes.<\/p>"}},"1e6b2df1-8e55-4ac5-9003-35ca3ab89af3":{"type":"column","settings":{"title":"Are these medicals authorised for work abroad?","text":"<p>Yes we work with GMC registered doctors and all of them are registered with the FCO. <\/p>"}},"710be9ac-fc12-4e2c-bcf1-77578f19a6e1":{"type":"column","settings":{"title":"What tests are carried out with the medical?","text":"<p>The tests carried out depend on the country you are travelling to. Each country has its own set of testing requirements, but we are aware of the conditions and will make sure that they comply. These tests usually involve a consultation with our doctors to check your ear, sight, and chest, followed by blood work and potentially an x-ray.<\/p>"}}},"block_order":["16548759333a7fc787-0","816d3c88-b735-4f19-86c6-40d3b028d0e0","4b4ce8ab-21b8-459b-8a7e-65c15878a89f","1e6b2df1-8e55-4ac5-9003-35ca3ab89af3","710be9ac-fc12-4e2c-bcf1-77578f19a6e1"],"settings":{"faq_section_show":true,"title":"Frequently Asked Questions","page_width":1140,"padding_top":100,"padding_bottom":100}}},"order":["main","1654875616d39f3567","3e7b8001-6fd0-4102-a5be-dfc24e13a930","16548756697ecdbbc4","1654875704034f9569","1654875933fdddff77"]}