{"sections":{"main":{"type":"packages-page","settings":{"padding_top":36,"padding_bottom":36}},"1654868074b9b67065":{"type":"packages-first-screen","disabled":true,"settings":{"image_background":"shopify:\/\/shop_images\/hero-bg.png","image_photo":"shopify:\/\/shop_images\/Founder.png","content_vertical_alignment":"center","reviews":false,"title":"Occupational Health","subtitle":"<p>Easily manage the health records of all your employees and maintain workplace safety. Use the Welzo medical app and platform for immediate access to occupational health requests. <\/p>","button_title":"","button_link":"#","show_logos":true,"title_news":"AS SEEN IN","padding_top":100,"padding_bottom":100}},"4574e1bc-1a35-474b-ad33-4d34116a2fe1":{"type":"image-banner","settings":{"image":"shopify:\/\/shop_images\/founder_2.png","image_overlay_opacity":0,"image_height":"medium","adapt_height_first_image":true,"desktop_content_position":"middle-center","show_text_box":true,"desktop_content_alignment":"left","color_scheme":"background-1","mobile_content_alignment":"left","stack_images_on_mobile":false,"show_text_below":false}},"1654872317e21084a6":{"type":"packages-info","settings":{"image_background":"shopify:\/\/shop_images\/Group_139.jpg","title":"<p>Our  Mission: Equality, Accessibility and Instantaneous Access to Healthcare for All<\/p>","text1":"<p>Adonis Hakkim, the CEO and founder of Welzo, a fully integrated healthcare platform, has a mission to revolutionize the healthcare industry by making healthcare accessible to all, regardless of their socio-economic status. With his expertise in the medical and tech fields, Adonis has created a platform that will help alleviate the burden on traditional healthcare systems and give individuals instant access to affordable healthcare.<\/p><p>Adonis's journey to creating Welzo began with his personal experience of seeing the inequalities in the healthcare system. Leaving his role as CEO of The HMI Group, one of the UK's largest occupational health care providers to create Welzo.  He recognized that traditional healthcare systems were expensive, time-consuming, and inconvenient for many people, particularly those in underserved communities. As a result, Hakkim decided to create a platform that would provide affordable and accessible healthcare to all.<\/p><p>Welzo aims to remove the barriers that prevent individuals from accessing healthcare. The platform provides individuals with access to healthcare professionals in real-time, allowing them to receive medical advice, prescriptions, and diagnoses without the need to leave their home. Through the use of modern technology, including telemedicine and AI, Welzo allows individuals to receive healthcare from anywhere in the world, at any time.<\/p><p>The platform also provides users with a personalized healthcare experience, which includes tracking their health metrics, receiving tailored health plans, and accessing relevant medical information. Welzo enables users to take control of their health and make informed decisions about their health and wellness.<\/p><p><\/p><p><\/p>","text2":"<p>Moreover, the platform has the potential to alleviate the burden on traditional healthcare systems. Traditional healthcare systems are often overcrowded, leading to longer wait times and delayed treatment. Welzo can provide individuals with immediate access to medical professionals, reducing the need for in-person appointments, and freeing up medical professionals to focus on more serious cases.<\/p><p>Hakkim's vision for Welzo is not just limited to the developed world. He recognizes that there is a significant need for healthcare access in underserved communities globally. To achieve this, Welzo has partnered with international healthcare organizations to provide affordable healthcare to those in need. The platform is currently being developed in multiple languages, making it accessible to people from diverse backgrounds and cultures.<\/p><p>In addition to providing healthcare access to individuals, Welzo is also committed to promoting overall health and wellness. The platform offers a variety of health-related content, including articles, videos, and infographics, to help users stay informed and educated about their health. Moreover, Welzo offers fitness and nutrition plans, enabling users to take control of their health holistically.<\/p><p>In conclusion, Adonis Hakkim's message for creating Welzo is to make healthcare accessible to all. By utilizing technology, Hakkim has created a platform that can help alleviate the burden on traditional healthcare systems, provide affordable healthcare to all, and promote overall health and wellness. Hakkim's vision for Welzo has the potential to transform the healthcare industry, making healthcare accessible and affordable for everyone, regardless of their background or societal level.<\/p>","padding_top":100,"padding_bottom":100}},"95011731-e4bb-4271-977f-403cbd6caa44":{"type":"experts-opinion","settings":{"image_background":"shopify:\/\/shop_images\/IMAGE_e3c78f08-4a2b-4405-8f60-eb294079cbc9.png","image_expert":"shopify:\/\/shop_images\/Facetune_21-01-2023-19-43-09.jpg","title":"Message from our founder","text":"<p>“The goal of Welzo is to provide instant access to healthcare, no matter where you are in the world. Our platform utilizes modern technology, including telemedicine and AI, to connect individuals with healthcare professionals in real-time, allowing for timely diagnoses, prescriptions, and medical advice. This will save time and money for individuals and reduce the burden on traditional healthcare systems.At Welzo, we believe that everyone deserves access to quality healthcare, regardless of their socio-economic status. That is why we have partnered with international healthcare organizations to provide affordable healthcare to underserved communities around the world. ”<\/p>","name":"Adonis Hakkim","profession":"Founder & CEO","color_scheme":"background-1","padding_top":40,"padding_bottom":52}},"16548680799be7db3a":{"type":"what-say","blocks":{"165486807969c7db33-0":{"type":"testimonial","settings":{"text":"<p>“Write is super-useful as we can see the actual text in the actual design. We can even adjust text length to make it look good!” <\/p>","image":"shopify:\/\/shop_images\/avatar1.png","name":"Linh Nguyen","profession":"Founder at Labs"}},"fe880d49-024c-42ea-a4f3-edb128e0a40a":{"type":"testimonial","settings":{"text":"<p>“Write is super-useful as we can see the actual text in the actual design. We can even adjust text length to make it look good!” <\/p>","image":"shopify:\/\/shop_images\/avatar2.png","name":"Linh Nguyen","profession":"Founder at Labs"}},"534ce6f4-b9bd-4e6d-aed8-331f027dafdc":{"type":"testimonial","settings":{"text":"<p>“Write is super-useful as we can see the actual text in the actual design. We can even adjust text length to make it look good!” <\/p>","image":"shopify:\/\/shop_images\/image_18.jpg","name":"Linh Nguyen","profession":"Founder at Labs"}},"4c0608dd-c1e7-4b24-b043-eb21aca390b7":{"type":"testimonial","settings":{"text":"<p>“Write is super-useful as we can see the actual text in the actual design. We can even adjust text length to make it look good!” <\/p>","image":"shopify:\/\/shop_images\/avatar3.png","name":"Linh Nguyen","profession":""}}},"block_order":["165486807969c7db33-0","fe880d49-024c-42ea-a4f3-edb128e0a40a","534ce6f4-b9bd-4e6d-aed8-331f027dafdc","4c0608dd-c1e7-4b24-b043-eb21aca390b7"],"disabled":true,"settings":{"background_image":"shopify:\/\/shop_images\/why-bg.png","background_image_mobile":"shopify:\/\/shop_images\/hero-mob-bg_1a3b4afa-bf8f-4758-a7ed-751f981ba4ec.png","header":"What clients say","header-why":"","quote_icon":"shopify:\/\/shop_images\/quote.png","padding_top":100,"padding_bottom":100,"hide_why_welzo":true}}},"order":["main","1654868074b9b67065","4574e1bc-1a35-474b-ad33-4d34116a2fe1","1654872317e21084a6","95011731-e4bb-4271-977f-403cbd6caa44","16548680799be7db3a"]}