{"sections":{"main":{"type":"pre-employment-page","settings":{"padding_top":36,"padding_bottom":36}},"1654875616d39f3567":{"type":"packages-first-screen","settings":{"image_background":"shopify:\/\/shop_images\/hero-mob-bg-2.png","image_photo":"shopify:\/\/shop_images\/realistic-shot-waving-flag-china-with-interesting-textures.jpg","content_vertical_alignment":"top","reviews":true,"title":"China Visa Medical","subtitle":"<p>Affordable and same day China embassy medicals. We are an authorised provider of embassy visa medicals.<\/p>","button_title":"Contact Us","button_link":"https:\/\/welzo.com\/pages\/contact","padding_top":100,"padding_bottom":100}},"16548756697ecdbbc4":{"type":"packages-info","settings":{"image_background":"shopify:\/\/shop_images\/Group_139.jpg","title":"<p>What Is a Chinese embassy medical?<\/p>","text1":"<p>Applying for a China visa can be a daunting task, especially if you're not familiar with the process. One of the most important steps in the application process is the medical exam, which is required for all applicants.<\/p><p><\/p><p>The purpose of the medical exam is to ensure that you are healthy enough to travel to China and that you do not pose a risk to public health. The exam will include a physical examination, blood tests, and X-rays. You may also be asked to provide proof of vaccinations against certain diseases.<\/p>","text2":"<p>The medical exam can be conducted by one of our qualified Welzo doctors. Be sure to bring your passport and any other required documents with you to the appointment. Once you have completed the medical exam, you will need to submit the results to the Chinese Embassy or Consulate.<\/p><p>If you have any questions about the medical exam or the visa application process, be sure to contact the Chinese Embassy or Consulate nearest you. They will be able to provide you with more information and assist you in completing your application.<\/p>","padding_top":100,"padding_bottom":100}},"1654875704034f9569":{"type":"why","blocks":{"165487570462420882-0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon2.png","title":"Authorised by embassies","text":"<p>Welzo only works with verified doctors and clinics authorised by embassies such as Harley Medic International.<\/p>"}},"37d52510-7415-4eac-8aec-579f871a286e":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon3.png","title":"Price matched","text":"<p>We price match all of our visa medicals. This guarantees we are the most affordable on the market. <\/p>"}},"75fa2fd9-fbaf-4a22-8123-d41929802ebd":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon4.png","title":"Efficient and Fast","text":"<p>We offer same day appointments and express results and certificate for visa issuance. <\/p>"}}},"block_order":["165487570462420882-0","37d52510-7415-4eac-8aec-579f871a286e","75fa2fd9-fbaf-4a22-8123-d41929802ebd"],"settings":{"image_background":"shopify:\/\/shop_images\/hero-mob-bg-2.png","title":"We Are The UK's Leading Visa Medical Provider","padding_top":100,"padding_bottom":100}},"1654875933fdddff77":{"type":"faq","blocks":{"16548759333a7fc787-0":{"type":"column","settings":{"title":"Where can I book my visa medical?","text":"<p>Booking a visa medical is a straightforward process. Simply head to the <a href=\"https:\/\/welzo.com\/pages\/contact\" title=\"https:\/\/welzo.com\/pages\/contact\">contact us<\/a> page by clicking here. Once you complete the contact us form, we will get in touch with you via email within 30 minutes to organise your appointment.<\/p>"}},"816d3c88-b735-4f19-86c6-40d3b028d0e0":{"type":"column","settings":{"title":"How much does the medical cost?","text":"<p>We offer the most affordable visa medicals on the market. Prices usually start from as low as £49 all the way up to £250 depending on the requirements for your travel destination.<\/p>"}},"1e6b2df1-8e55-4ac5-9003-35ca3ab89af3":{"type":"column","settings":{"title":"Are these medicals authorised for work abroad?","text":"<p>Yes we work with GMC registered doctors and all of them are registered with the FCO. <\/p>"}},"710be9ac-fc12-4e2c-bcf1-77578f19a6e1":{"type":"column","settings":{"title":"What tests are carried out with the medical?","text":"<p>The tests carried out depend on the country you are travelling to. Each country has its own set of testing requirements, but we are aware of the conditions and will make sure that they comply. These tests usually involve a consultation with our doctors to check your ear, sight, and chest, followed by blood work and potentially an x-ray.<\/p>"}},"1c338dd3-1669-4899-919f-bf8729dcf703":{"type":"column","settings":{"title":"How long does it a Chinese medical take?","text":"<p>A Chinese medical usually takes  under an hour. However, if you have a pre-existing medical condition or are pregnant, the exam may take longer.<\/p>"}},"ba5b1f0f-d139-48df-8701-8ef0e39a1798":{"type":"column","settings":{"title":"What should I expect during the Chinese medical exam?","text":"<p>During the medical exam, a doctor will conduct a physical examination and take your blood pressure, pulse, and temperature. You will also be asked about your medical history and any medications you are currently taking. Be sure to bring a list of all medications you are taking, as well as any allergies you have.<\/p>"}}},"block_order":["16548759333a7fc787-0","816d3c88-b735-4f19-86c6-40d3b028d0e0","1e6b2df1-8e55-4ac5-9003-35ca3ab89af3","710be9ac-fc12-4e2c-bcf1-77578f19a6e1","1c338dd3-1669-4899-919f-bf8729dcf703","ba5b1f0f-d139-48df-8701-8ef0e39a1798"],"settings":{"title":"Frequently Asked Questions","padding_top":100,"padding_bottom":100}}},"order":["main","1654875616d39f3567","16548756697ecdbbc4","1654875704034f9569","1654875933fdddff77"]}