{"sections":{"main":{"type":"main-staff","blocks":{"employee-1":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/Screenshot_2023-01-19_at_22.31.55.png","full-name":"Dr Sameer Nakedar","position":"MBBS (London), MRCGP, PGCert","description":"<p>I am a portfolio GP with an interest in digital technology solutions and healthcare applications. Having successfully founded and built cross-platform applications that have served primary and secondary providers in many countries, I also have a passion for sharing information and teaching. Having worked myself for many years both in hospital and GP settings, I am a first hand witness to the benefits technology can add to healthcare for patients. That's why I support Welzo. I believe the team have beautifully blended cutting edge technology and strategic partnerships with experts in logistics, technology, customer relations and healthcare to deliver a robust, smooth and cost effective model for patients to benefit from.<\/p>","expert-in":"Healthy Living; Obstetrics; Gynaecology; Psychiatry; Genitourinary medicine; General medicine;","link-linkedin":"https:\/\/www.linkedin.com\/in\/dr-sameer-nakedar-826302119\/","link-facebook":"#","link-twitter":"#"}},"employee-2":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/Image_2.jpg","full-name":"Robin Jane","position":"UK Surgeon General","description":"<p>I am a portfolio GP with an interest in digital technology solutions and healthcare applications. Having successfully founded and built cross-platform applications that have served primary and secondary providers in many countries, I also have a passion for sharing information and teaching. Having worked myself for many years both in hospital and GP settings, I am a first hand witness to the benefits technology can add to healthcare for patients. That's why I support Welzo. I believe the team have beautifully blended cutting edge technology and strategic partnerships with experts in logistics, technology, customer relations and healthcare to deliver a robust, smooth and cost effective model for patients to benefit from.<\/p>","expert-in":"Healthy Living;Binge Watching and Your Health;Allergies, Blood & Immune System;Digestive Health","link-linkedin":"#","link-facebook":"#","link-twitter":"#"}},"eb6fb305-3f6e-4e50-bc0e-d120260c8d44":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/WhatsApp_Image_2022-08-05_at_8.46.38_PM.jpg","full-name":"Dr Mo Janson","position":"Medical Content Creator","description":"<p>I am Dr Muhammad Jan, a doctor by profession and certified health writer. Writing is my obsession and passion. I always want to share my theoretical and clinical knowledge with the World. For that reason, a platform is very important.<br\/>Thanks to Welzo, which provided me with this opportunity to extend my thoughts and opinions to the people and solve their health issues. I believe that Welzo is a great model for experts to deliver their valuable experience to patients. I will always look forward to working with the Welzo team.<\/p>","expert-in":"Healthy Living; Health Care;\nDentistry; Pharmaceuticals; Oral Health: Medical Academia;","link-linkedin":"https:\/\/www.linkedin.com\/mwlite\/in\/dr-muhammad-jan-960578113","link-facebook":"","link-twitter":"https:\/\/twitter.com\/DrMuhammadJan4\/status\/1555644190947586048?s=19"}},"061256ea-5998-4631-b59a-5be8f5235f24":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/dr_zeeshan.jpg","full-name":"Dr Zeeshan Afzal","position":"Health Content Advisor","description":"<p>I am a practising Doctor with expertise in exploring disease processes and using clinical innovations for disease management. Throughout my studies, I have been engaged in teaching. It has sharpened my communication skills. The postgraduate experience has further sharpened it by adding technical writing skills to my rapidly growing profile. I am a keen observer of the evolution of disease processes and the effects of clinical interventions on them. That is why I opted to join Welzo. The team is unique in that it combines the expertise of a vast array of people, from basic scientists to clinicians and technologists, and offers a complete health solution for patients and the general population. I hope to see Welzo growing and expanding in scope. I am determined to add my clinical and scientific knowledge to this purpose.<\/p>","expert-in":"General medicine; General and systemic pathology; Pathobiology; Physiology; Health and basic nutrition","link-linkedin":"https:\/\/www.linkedin.com\/in\/dr-zeeshan-afzal-31b218120\/","link-facebook":"","link-twitter":""}},"931927a0-b008-4ef0-a810-5fb73a112891":{"type":"employee","disabled":true,"settings":{"photo":"shopify:\/\/shop_images\/mahyar.jpg","full-name":"Mahyar Nickkho-Amiry","position":"Superintendent Pharmacist; GPhC 2054727","description":"<p>I am the Superintendent Pharmacist & Managing Director of Dears Pharmacy Group. We open and operate a group of pharmacies in Scotland as well as our internet pharmacy that services the UK.<\/p><p>At Dears pharmacy we put the community at the heart of pharmacy and pharmacy at the heart of the community. We provide personalised, tailored pharmaceutical care to the people who use our pharmacies and dispense both medicines and healthcare advice tailored to meet their specific needs.<\/p><p>We offer an accessible and approachable first port of call for healthcare advice in the communities where our patients live. We invest in our communities, building relationships with local healthcare organizations, businesses and supporting local charities in their work.<br\/><\/p><p>We firmly believe in the world we live in the benefits that technology can add to healthcare for patients. That's why are proud to work and support Welzo. We believe the team have blended a combination of cutting edge technology and strategic partnerships to deliver a robust, smooth and cost effective model for patients to benefit from.<\/p>","expert-in":"pharmacy; online medicine; healthcare; travel health; pharmaceuticals;","link-linkedin":"","link-facebook":"","link-twitter":""}},"ad6d61bc-e292-4c8b-acf1-2f762eee933a":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/Untitled_design.jpg","full-name":"Samantha Burgess","position":"Lead Healthcare Content Creator","description":"<p>I am a published journalist with an avid interest in the advancing world of health and medicine. Having completed my university studies during the Covid-19 pandemic, I focused a lot of my work on the healthcare industry and those who diligently work in it.<\/p><p>I grew up in Melbourne, Australia to two doctors and a family that prioritized healthy living. In my professional career, I’ve aimed at bringing positive awareness to important matters both in the medical field and the broader community. <\/p><p>I’m excited to be a part of the Welzo team because of their philosophy to provide customers with the most accurate information and products to ensure that they have the best health possible. <\/p>","expert-in":"Journalism; Wellness; Health Journalism; Medical Journalism; Women's Health; Mental Health; Nutrition; Medical News","link-linkedin":"","link-facebook":"","link-twitter":""}},"114ce6d9-4cba-4366-b44a-61143d1064a9":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/Adonis_Welzo_3_copy.png","full-name":"Adonis Hakkim","position":"CEO and Founder","description":"<p>Serial Med-Tech entrepreneur Adonis Hakkim was previously the CEO of the HMI Group, one of the UK's largest occupational health platforms. Adonis has been featured in Forbes, Yahoo Business and Market Watch for successfully scaling some of the fastest-growing healthcare businesses.<\/p>","expert-in":"healthcare, health technology, med-tech, AI-Powered Healthcare","link-linkedin":"https:\/\/www.linkedin.com\/company\/harley-medic-international-limited\/?originalSubdomain=uk","link-facebook":"","link-twitter":""}},"b055d715-1df4-4e7c-a002-5c4425ddd13c":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/Screenshot_2023-04-22_at_17.58.24.png","full-name":"Dr James Walker","position":"Contracted Medical Advisor","description":"<p>Dr. Walker is an exceptionally skilled and empathetic physician who has dedicated 20 years of his life to the medical field. He is widely recognized for his meticulous approach to patient care, which involves taking time to understand each patient's unique medical history and circumstances. Dr. Walker is an expert at establishing a strong bond with his patients, which allows him to provide medical care that is both effective and compassionate.<\/p><p>To stay current with the latest medical advancements and techniques, Dr. Walker regularly attends medical conferences and seminars. This dedication to professional development has earned him a reputation as a leading medical professional in his field.<\/p><p>When he is not attending to his patients' needs, Dr. Walker is an avid cook and enjoys spending quality time with his family. His passion for cooking has given him the opportunity to explore different cuisines and experiment with new recipes. Dr. Walker is a family man and values spending quality time with his loved ones.<\/p><p>Dr. Walker is also passionate about giving back to his community and is involved in multiple charities. His dedication to charitable causes has helped many people in his community, and he is a source of inspiration to others who wish to make a difference in their community.<\/p>","expert-in":"Healthcare; Medicine; Dermatology; Biochemistry; Healthy Living; Obstetrics; Gynaecology; Psychiatry; Genitourinary medicine; General medicine;","link-linkedin":"","link-facebook":"","link-twitter":""}},"54daad02-2543-4a77-8d95-6aa69d98f8c9":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/IMG_0657.jpg","full-name":"Paola Drexler","position":"Medical & Health Author","description":"<p>I am a content manager and writer with an interest in health and wellness. Having obtained my journalism degree and extensively travelled, I am very curious and open to learning new things. As a competitive powerlifter, I am also passionate about fitness and strength training, focusing on healthy eating and living. I believe Welzo is greatly impacting the world in a positive way with its innovation, expertise and customer-focused approach.<\/p>","expert-in":"Medical Writing; Bodybuilding; Fitness; Fitness Journalism; Journalism; Wellness; Health Journalism; Medical Journalism; Women's Health; Mental Health; Nutrition; Medical News","link-linkedin":"https:\/\/www.linkedin.com\/in\/paola-drexler-993b77287\/","link-facebook":"","link-twitter":""}},"abe5c8fa-03e6-4d03-8476-88e64c263348":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/1676741858878.jpg","full-name":"Dr Blen Tesfu","position":"Contracted Medical Advisor","description":"<p>I am a practicing physician who is also pursuing  master's in epidemiology and Public Health. I have extensive experience working in primary as well as Tertiary care settings, particularly with women's health and reproductive medicine, communicable diseases, and non-communicable illnesses. Throughout my role as General Practitioner, I have gained diverse knowledge and experience on complex medical topics and dedication to patient education and promotional activities for public well-being initiatives. I am passionate about staying up-to-date on the latest research findings through research publications, journal articles, and guidelines that help inform the best evidence-based practices when treating patients across different communities worldwide.<br\/><br\/>As part of the team working at Welzo, I am thoroughly impressed by their highly skilled medical writers and experts. I have witnessed firsthand the amount of dedicated work that goes into creating informative materials to raise awareness about diseases, health promotion, and advocacy globally. It is this dedication that makes me proud to work for such an organization that promotes positive change in people's lives through education about healthcare options available worldwide.<\/p>","expert-in":"Epidemiology; General Practise; Communicable diseases; General Practitioner; Public Health; Patient Education","link-linkedin":"https:\/\/www.linkedin.com\/in\/dr-blen-tesfu-00b0a0218\/","link-facebook":"","link-twitter":""}},"240ac493-dc1c-45e4-9361-d8fd20816958":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/1676741858878_3ac4e9e9-b1d0-4287-9ee4-8db81edc300d.jpg","full-name":"Dr Blen Tesfu","position":"Contracted Medical Advisor","description":"<p>I am a practicing physician who is also pursuing  master's in epidemiology and Public Health. I have extensive experience working in primary as well as Tertiary care settings, particularly with women's health and reproductive medicine, communicable diseases, and non-communicable illnesses. Throughout my role as General Practitioner, I have gained diverse knowledge and experience on complex medical topics and dedication to patient education and promotional activities for public well-being initiatives. I am passionate about staying up-to-date on the latest research findings through research publications, journal articles, and guidelines that help inform the best evidence-based practices when treating patients across different communities worldwide.<br\/><br\/>As part of the team working at Welzo, I am thoroughly impressed by their highly skilled medical writers and experts. I have witnessed firsthand the amount of dedicated work that goes into creating informative materials to raise awareness about diseases, health promotion, and advocacy globally. It is this dedication that makes me proud to work for such an organization that promotes positive change in people's lives through education about healthcare options available worldwide.<\/p>","expert-in":"Epidemiology; General Practise; Communicable diseases; General Practitioner; Public Health; Patient Education","link-linkedin":"https:\/\/www.linkedin.com\/in\/dr-blen-tesfu-00b0a0218\/","link-facebook":"","link-twitter":""}},"38fcd21a-a8da-4cea-93da-206780d3b06f":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/IMG-20160821-WA0043.jpg","full-name":"Dr Kezia Joy","position":"Medical Content Advisor","description":"<p>I’m a doctor along with being an experienced medical writer. Extensive hands-on experience in the medical field, catering to the treatment of dental patients made me realize the need for better access to medical knowledge and healthcare for all individuals. From contributing to the yearly magazines during my university days to authoring an academic book, along with contributing to medical content on an online platform, the journey has been well rewarding.<br\/><\/p><p>It has been an immense pleasure to work with Welzo, the UK’s leading healthcare platform that aims to bridge the care gap in healthcare for all individuals. With a team of well-qualified doctors and medical researchers, it is sure to revolutionize the healthcare industry. While making convenient healthcare available from home, Welzo’s health hub thrives in creating extensive and accurate medical knowledge, that is available for all individuals.<br\/><\/p>","expert-in":"Healthcare; Medicine; Dermatology; Biochemistry; Healthy Living; Obstetrics; Gynaecology; Psychiatry; Dentistry; General medicine;","link-linkedin":"","link-facebook":"","link-twitter":""}},"84790eac-ff3f-4b72-99fa-8a36144dc96c":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/Screenshot_2023-08-10_at_12.06.18.png","full-name":"Dr Adam Williams","position":"Medical Contributor","description":"<p>Dr Adam Williams might seem like an enigmatic figure in the world of medical writing, but there's a simple explanation behind the name. Serving as the default author for Welzo.com, \"Dr Adam Williams\" represents the collective expertise and dedication of numerous professionals who have collaborated on a piece. When you come across this name, you're witnessing the amalgamation of insights, research, and perspectives from a multitude of esteemed individuals.<\/p><p>Among the talented contributors under the umbrella of Dr Williams are Dr Sameer Nakedar, Dr Zeeshan Afzal, Dr Mo Janson, Dr Joy, Dr Blen Tesfu, Paola Drexlar, and several others. Each one, in their respective fields, brings forth a depth of knowledge and a passion for sharing medical wisdom with the wider world.<\/p><p>When an article is credited to Dr Adam Williams, readers can be assured that they're not just receiving information from one medical expert, but rather the consolidated wisdom of many. Welzo.com takes pride in this collaborative approach, ensuring that content is both diverse in perspective and rigorous in accuracy.<\/p><p>In essence, Dr Adam Williams is more than just a name—it's a symbol of the collaborative spirit and dedication that drives Welzo.com to deliver top-tier medical content.<\/p>","expert-in":"Healthcare; Medicine; Dermatology; Biochemistry; Healthy Living; Obstetrics; Gynaecology; Psychiatry; Genitourinary medicine; General medicine;","link-linkedin":"","link-facebook":"","link-twitter":""}},"b4960e1c-abf2-43d9-8b21-a12e1b744f8b":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/pleased-young-female-doctor-wearing-medical-robe-stethoscope-sitting-desk-with-medical-tools-putting-hands-desk-isolated-pink-wall.jpg","full-name":"Dr Sadia Saeed","position":"Medical Content Creator","description":"<p>I’m a dynamic medical content creator and my journey in the world of healthcare extends far beyond the realm of writing. With a genuine dedication to making a difference, I’ve engaged in a variety of medical-related social initiatives that have not only deepened my understanding and also fuelled my passion for medicine and research. I'm a final year medical student of MBBS in Khyber Girls Medical College, Peshawar Pakistan and have participated in various social work programmes at Hayatabad Medical Complex Hospital in Peshawar.<\/p><p><\/p><p>I firmly believe in the significance of Welzo’s mission – to deliver valuable medical insights that empower individuals to make informed<br\/>decisions about their health.<\/p>","expert-in":"Healthcare; Medicine; Dermatology; Biochemistry; Healthy Living; Obstetrics; Gynaecology; Psychiatry; Genitourinary medicine; General medicine;","link-linkedin":"","link-facebook":"","link-twitter":""}},"a6aba2d3-1283-417e-91d3-0c88e1e7b571":{"type":"employee","settings":{"photo":"shopify:\/\/shop_images\/Thomas_C_Daniel.jpg","full-name":"Thomas Daniel","position":"QA & Content Manager","description":"<p>I'm Thomas Daniel, QA and Content writer. At the heart of it, I'm a guy who loves blending detail with creativity. When I'm not at my desk, I'm probably trying out tunes on my favourite guitar or discovering new instruments. I studied business in school, and now at Welzo, I combine that knowledge with my love for content. I ensure everything we produce is top-notch and engaging. I truly believe in the power of good content and a melody that sticks. Let's make some harmonious work together!<\/p>","expert-in":"Healthcare; Medicine; Dermatology; Biochemistry; Healthy Living; Obstetrics; Gynaecology; Psychiatry; Genitourinary medicine; General medicine;","link-linkedin":"https:\/\/www.linkedin.com\/in\/thomascdaniel\/","link-facebook":"","link-twitter":""}}},"block_order":["employee-1","employee-2","eb6fb305-3f6e-4e50-bc0e-d120260c8d44","061256ea-5998-4631-b59a-5be8f5235f24","931927a0-b008-4ef0-a810-5fb73a112891","ad6d61bc-e292-4c8b-acf1-2f762eee933a","114ce6d9-4cba-4366-b44a-61143d1064a9","b055d715-1df4-4e7c-a002-5c4425ddd13c","54daad02-2543-4a77-8d95-6aa69d98f8c9","abe5c8fa-03e6-4d03-8476-88e64c263348","240ac493-dc1c-45e4-9361-d8fd20816958","38fcd21a-a8da-4cea-93da-206780d3b06f","84790eac-ff3f-4b72-99fa-8a36144dc96c","b4960e1c-abf2-43d9-8b21-a12e1b744f8b","a6aba2d3-1283-417e-91d3-0c88e1e7b571"],"settings":{"background_image":"shopify:\/\/shop_images\/hero-staff.png","background_image_mobile":"shopify:\/\/shop_images\/hero-staff-mob.png","padding_top":36,"padding_bottom":36}},"latest-articles":{"type":"latest-articles-slider","settings":{"title":"Latest articles","link_all":"\/pages\/health-hub-page#All-articles","count_latest_articles":6,"tags":"","blog-menu":"blogs","padding_top":70,"padding_bottom":70}},"klaviyo":{"type":"klaviyo","settings":{"image_background":"shopify:\/\/shop_images\/klaviyo-bg.png","title":"Get 10% off your first order","text":"<p>Plus get the inside scoop on our latest content and updates in our monthly newsletter.<\/p>","padding_top":40,"padding_bottom":52}}},"order":["main","latest-articles","klaviyo"]}