{"sections":{"1655185090979d9a83":{"type":"packages-first-screen","settings":{"image_background":"shopify:\/\/shop_images\/hero-bg.png","image_photo":"shopify:\/\/shop_images\/blond-woman-working-call-center-with-headphones-computer.jpg","content_vertical_alignment":"top","reviews":false,"title":"Complaints Procedure","subtitle":"<p>At Welzo.com, we are fully committed to providing you with exceptional digital healthcare. We understand, however, that there may be instances where you are not completely satisfied with our services. It's our policy to ensure we provide a fair and effective resolution to any issues that might arise. Below, we've detailed our complaints procedure.<\/p>","button_title":"","button_link":"","show_logos":false,"title_news":"AS SEEN IN","image_news1":"shopify:\/\/shop_images\/221.png","image_news2":"shopify:\/\/shop_images\/yahoo_01d90440-d295-40e7-9266-347e0db579ff.png","image_news3":"shopify:\/\/shop_images\/bbc_1d5ebdf6-f9d9-4ac5-bd58-9216009fa97d.png","image_news4":"shopify:\/\/shop_images\/cbs_c370b3e1-b0f3-47df-af4d-f0d778d2d42d.png","padding_top":100,"padding_bottom":100}},"f0cec911-7aa6-44fb-9adb-4a2d2284280b":{"type":"simple_text","blocks":{"template--15523333308509__f0cec911-7aa6-44fb-9adb-4a2d2284280b-heading-1":{"type":"heading","settings":{"heading":"Complaints Procedure"}},"template--15523333308509__f0cec911-7aa6-44fb-9adb-4a2d2284280b-text-1":{"type":"text","settings":{"text":"<h2><strong>1. Introduction<\/strong><\/h2><h3><strong>1.1 Background and Purpose<\/strong><\/h3><p>Welzo Limited is committed to providing the highest level of services to its customers. However, we acknowledge that there may be instances when our customers are not entirely satisfied with our services. This comprehensive Complaints Handling Process is designed to guide our employees and customers in efficiently and effectively addressing customer complaints.<\/p><h3><strong>1.2 Scope<\/strong><\/h3><p>This process covers all aspects of handling complaints at Welzo Limited, ensuring that each complaint is treated seriously and resolved promptly. It applies to all employees and departments within the organisation.<\/p><h3><strong>1.3 Objectives<\/strong><\/h3><h4><strong>The objectives of this process are:<\/strong><\/h4><ul><li>To provide a structured and consistent approach to handling complaints.<\/li><li>To ensure that all complaints are acknowledged and investigated in a timely manner.<\/li><li>To provide resolutions that are fair and reasonable to the satisfaction of our customers.<\/li><li>To use complaints as a valuable source of feedback for continuous improvement.<\/li><\/ul><h2><strong>2. Defining a Complaint<\/strong><\/h2><h3><strong>2.1 What Constitutes a Complaint?<\/strong><\/h3><p>A complaint, within the context of this process, is defined as any expression of dissatisfaction by a customer or stakeholder regarding Welzo Limited's products, services, or interactions. Complaints may be related to issues such as service quality, billing, communication, or any other aspect of our operations.<\/p><h3><strong>2.2 Types of Complaints<\/strong><\/h3><p>Complaints can vary in nature and scope, including but not limited to:<\/p><ul><li>Service-related complaints<\/li><li>Billing and payment disputes<\/li><li>Product defects or issues<\/li><li>Communication problems<\/li><li>Customer service concerns<\/li><\/ul><p>Recognising the various types of complaints is essential to addressing them effectively.<\/p><h2><strong>3. Receiving and Acknowledging Complaints<\/strong><\/h2><h3><strong>3.1 Initial Contact<\/strong><\/h3><p>Customers who wish to raise a complaint can do so through the following channels:<\/p><p><a href=\"https:\/\/welzo.zendesk.com\/hc\/en-gb\" title=\"https:\/\/welzo.zendesk.com\/hc\/en-gb\">Contact us by clicking here.<\/a><\/p><p>Write to our head office address at:<\/p><p>Welzo Limited - Head of Customer Services<\/p><p>833, 19-21 Crawford Street,<\/p><p>London,<\/p><p>W1H 1PJ<\/p><h3><strong>3.2 Acknowledgement of Complaint<\/strong><\/h3><p>Upon receiving a complaint, Welzo Limited is committed to acknowledging receipt within 48 hours, confirming that the complaint is under investigation. This acknowledgment will include a reference number for tracking purposes.<\/p><h3><strong>3.3 Importance of Timely Acknowledgment<\/strong><\/h3><p>Timely acknowledgment is critical to assure the customer that their concerns are taken seriously. It also sets clear expectations for the complaint resolution process.<\/p><h2><strong>4. Investigation and Resolution<\/strong><\/h2><h3><strong>4.1 Stage 1: Initial Resolution<\/strong><\/h3><p>The initial resolution stage aims to address and resolve complaints as quickly as possible. Most complaints can be resolved at this stage. The process includes the following steps:<\/p><h4><strong>Step 1: Complaint Investigation<\/strong><\/h4><p>One of our customer service team members will thoroughly investigate the complaint, taking into account all relevant information and any previous correspondence.<\/p><p>Liaison with relevant departments may be necessary to gather additional details including but not limited to our external suppliers, warehouse management and testing laboratories.<\/p><h4><strong>Step 2: Communication<\/strong><\/h4><p>We will communicate with the customer regarding our findings and proposed resolution.<\/p><p>This communication can take place via email or a phone conversation.<\/p><h4><strong>Step 3: Resolution<\/strong><\/h4><p>Our goal is to resolve complaints within 10 business days from the date of acknowledgment.<\/p><p>The resolution will be detailed in the communication to the customer.<\/p><h3><strong>4.2 Stage 2: Escalation<\/strong><\/h3><p>If the customer is not satisfied with the resolution provided at Stage 1, they have the option to escalate their complaint. The escalation process involves the following steps:<\/p><h4><strong>Step 1: Request for Escalation<\/strong><\/h4><p>The customer should express their dissatisfaction with the initial resolution and request escalation.<\/p><p>This request should be sent to the Head of Customer Services at our head office address or <a href=\"https:\/\/welzo.zendesk.com\/hc\/en-gb\" title=\"https:\/\/welzo.zendesk.com\/hc\/en-gb\">contacting us here. <\/a><\/p><h4><strong>Step 2: Review by Management<\/strong><\/h4><p>The Head of Customer Services will forward the escalated complaint to the relevant department's manager.<\/p><p>The manager will review the complaint and the initial resolution.<\/p><p>Additional actions may be taken as necessary to address the complaint.<\/p><h4><strong>Step 3: Resolution<\/strong><\/h4><p>The aim is to provide a resolution within 10 working days from the date of escalation acknowledgment.<\/p><p>The resolution will be communicated to the customer.<\/p><h3><strong>4.3 Timescales for Handling Complaints<\/strong><\/h3><p>Timely handling of complaints is a priority for Welzo Limited. The following timescales apply to each stage:<\/p><h4><strong>Stage 1:<\/strong><\/h4><p>Aim to acknowledge the complaint within 48 hours.<\/p><p>Full resolution within 10 business days.<\/p><h4><strong>Stage 2:<\/strong><\/h4><p>Aim to acknowledge the escalated complaint within 5 - 10 working days.<\/p><p>Full resolution within 10 working days.<\/p><h3><strong>4.4 Extending Time Limits<\/strong><\/h3><p>In some cases, complaints may be complex or require input from third parties including but not limited to our external suppliers, warehouse management and testing laboratories. In such instances, it may be necessary to extend the time limit for resolution. If this occurs, we will keep the customer fully informed of the progress, reasons for the delay, and the new deadline.<\/p><h2><strong>5. Recording and Monitoring Complaints<\/strong><\/h2><h3><strong>5.1 Importance of Complaint Records<\/strong><\/h3><p>All complaints received are logged and recorded to:<\/p><ul><li>Keep track of the types of problems customers face.<\/li><li>Determine the best ways to resolve them.<\/li><li>Record the time taken to deal with them.<\/li><\/ul><h3><strong>5.2 Monitoring Complaints<\/strong><\/h3><p>Regular monitoring of complaints is essential for identifying trends, recurring issues, or areas requiring improvement. This information feeds into our continuous improvement efforts.<\/p><h3><strong>5.3 Continuous Improvement<\/strong><\/h3><p>Complaints are viewed as valuable feedback that can drive positive change within Welzo Limited. We actively seek to learn from complaints and make improvements to prevent future occurrences.<\/p><h2><strong>6. External Support<\/strong><\/h2><h3><strong>6.1 Seeking Independent Assistance<\/strong><\/h3><p>If a customer remains unsatisfied with the outcome or the handling of their complaint, they have the option to seek independent advice and support. <\/p><h2><strong>7. Confidentiality and Data Protection<\/strong><\/h2><h3><strong>7.1 Handling of Customer Data<\/strong><\/h3><p>All complaints received are handled confidentially and in accordance with data protection regulations. Customer data is protected, and only authorised personnel involved in the complaint resolution process have access to relevant information.<\/p><h3><strong>7.2 Compliance with Data Protection Regulations<\/strong><\/h3><p>Welzo Limited complies with all applicable data protection regulations, including the Data Protection Act 1998, to ensure that customer data is handled securely and in accordance with legal requirements.<\/p><h2><strong>8. Conclusion<\/strong><\/h2><p>Welzo Limited is dedicated to providing excellent service to our customers, and we take complaints seriously as opportunities for improvement. This Complaints Handling Process outlines the step-by-step procedures in place to ensure that every complaint is acknowledged, investigated, and resolved to the satisfaction of our customers.<\/p><p>By following this process, we aim to enhance customer satisfaction, maintain the highest standards of service, and continuously improve our operations based on valuable customer feedback. <\/p><p>At Welzo Limited, we remain committed to turning every customer's experience into a positive one, and your feedback plays a crucial role in achieving this goal.<\/p>"}}},"block_order":["template--15523333308509__f0cec911-7aa6-44fb-9adb-4a2d2284280b-heading-1","template--15523333308509__f0cec911-7aa6-44fb-9adb-4a2d2284280b-text-1"],"settings":{"padding_top":40,"padding_bottom":52}},"16551852697ebd58a0":{"type":"packages-info","disabled":true,"settings":{"image_background":"shopify:\/\/shop_images\/Group_139.jpg","title":"<p>Complaints Procedure<\/p>","text1":"<p><strong>Step 1: Get in Touch<\/strong><\/p><p>If you're not entirely satisfied with any part of our service, we invite you to contact us directly at <a href=\"mailto:hello@welzo.com\">hello@welzo.com<\/a>. Please include your full name, contact information, and a detailed description of your complaint. This is the quickest way to get a response and allows us to start investigating the problem immediately.<\/p><p><strong>Step 2: Acknowledgement of Your Complaint<\/strong><\/p><p>Once we receive your email, we will acknowledge receipt within 48 hours, to confirm that we are looking into the matter.<\/p><p><strong>Step 3: Investigation<\/strong><\/p><p>We take all complaints seriously. Our dedicated customer service team will conduct an in-depth investigation of your complaint, liaising with relevant departments where necessary. This process ensures we understand the entirety of the issue and can work to provide the best solution.<\/p>","text2":"<p><strong>Step 4: Resolution<\/strong><\/p><p>After conducting our investigation, we aim to resolve all complaints within 10 business days. You will receive a full response to your email explaining our findings and detailing the actions we have taken to rectify the issue.<\/p><p><strong>Step 5: Further Actions<\/strong><\/p><p>If you're not satisfied with the resolution provided, you may request for your complaint to be escalated. A senior member of our team will review your complaint and our response, taking further action if necessary.<\/p><p>At Welzo.com, we take your feedback seriously and use it as a tool for improving our services. We deeply regret any inconvenience or dissatisfaction, and we're committed to turning your experience around. Your satisfaction is of utmost importance to us, and we're dedicated to ensuring every customer has a positive experience with our services.<\/p>","padding_top":100,"padding_bottom":100}},"eb1c9125-8521-4456-aa80-946c970d4eb9":{"type":"contact-form","blocks":{"template--14895778168925__eb1c9125-8521-4456-aa80-946c970d4eb9-1670844488588d96b2-1":{"type":"address","settings":{"title":"Offices","text":"833, 19 - 21 Crawford Street, W1H 1PJ, London, United Kingdom"}},"c99a0af7-3089-4489-b97f-e4c0a40ee219":{"type":"social","settings":{"title":"Social","linkedin":"https:\/\/www.linkedin.com\/company\/welzo\/","twitter":"https:\/\/twitter.com\/welzouk","meta":"https:\/\/www.facebook.com\/welzohealth\/","instagram":"https:\/\/www.instagram.com\/welzohealth\/?hl=en"}}},"block_order":["template--14895778168925__eb1c9125-8521-4456-aa80-946c970d4eb9-1670844488588d96b2-1","c99a0af7-3089-4489-b97f-e4c0a40ee219"],"settings":{"title":"Complaints Form","text":"<p>You can contact us by <a href=\"https:\/\/welzo.zendesk.com\/hc\/en-gb\" title=\"https:\/\/welzo.zendesk.com\/hc\/en-gb\">clicking here. <\/a><\/p>","color_scheme":"background-1","padding_top":56,"padding_bottom":36}}},"order":["1655185090979d9a83","f0cec911-7aa6-44fb-9adb-4a2d2284280b","16551852697ebd58a0","eb1c9125-8521-4456-aa80-946c970d4eb9"]}