{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28,"alignment_title":"left"}},"e2b7edc1-d652-4618-b007-0003c3d77ed7":{"type":"hero-section-3","blocks":{"template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-0":{"type":"heading","settings":{"heading":"Pumpkin Seed","heading_size":"medium","show_line":false}},"template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-1":{"type":"text","settings":{"text":"Protein, fiber, vitamins, minerals, and antioxidants are all present in pumpkin seeds in good amounts. They have been demonstrated to have advantages for weight loss, diabetes management, and heart health.You can eat pumpkin seeds raw, roasted, or toasted. They can also be used to prepare a wide range of foods, such as breads, desserts, and soups. This article is meant to provide information to Welzo users so they can better understand pumpkin seeds."}},"3697b572-00b3-4873-aadb-01e85df03254":{"type":"button","settings":{"button_label":"Overview","button_link":""}},"c39256d7-f8c0-462f-9109-cc5c53138458":{"type":"button","settings":{"button_label":"Uses","button_link":""}},"e1738aef-38ac-4846-bb48-4dbbbbed5d87":{"type":"button","settings":{"button_label":"Side Effects","button_link":""}},"02803003-6821-40cf-95ac-12d635aeedde":{"type":"button","settings":{"button_label":"Medication","button_link":""}},"6dd2932b-340e-4452-9c4a-96e1a9b89318":{"type":"button","settings":{"button_label":"Ingredients","button_link":""}},"7cfda700-4c13-4a17-9f5a-f70032e2217f":{"type":"button","settings":{"button_label":"Supplements","button_link":""}},"9507a9fe-9b42-4083-bc48-a0a94b4ace7a":{"type":"button","settings":{"button_label":"Pharmacokinetics","button_link":""}},"template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-3":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/image-349-768x512.png"}}},"block_order":["template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-0","template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-1","3697b572-00b3-4873-aadb-01e85df03254","c39256d7-f8c0-462f-9109-cc5c53138458","e1738aef-38ac-4846-bb48-4dbbbbed5d87","02803003-6821-40cf-95ac-12d635aeedde","6dd2932b-340e-4452-9c4a-96e1a9b89318","7cfda700-4c13-4a17-9f5a-f70032e2217f","9507a9fe-9b42-4083-bc48-a0a94b4ace7a","template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-3"],"settings":{"body_text":"#12022f","padding_top":36,"padding_bottom":150}},"d767a08c-c125-438f-9f72-7cd51abe473c":{"type":"simple_text","blocks":{"template--15291250016349__d767a08c-c125-438f-9f72-7cd51abe473c-1665156877c07d7099-0":{"type":"heading","settings":{"heading":"What is Pumpkin Seed?"}},"template--15291250016349__d767a08c-c125-438f-9f72-7cd51abe473c-1665156877c07d7099-1":{"type":"text","settings":{"text":"<p>The edible seed of a pumpkin or some other varieties of squash is known as a pumpkin seed, also known as a pepita.The seeds are typically flat and asymmetrically oval, covered in a white husk that can be removed to reveal a green interior.Large, hard seeds that are challenging to separate from the flesh are present in some squash varieties; roasted pumpkin seeds with the husks removed are sometimes referred to as \"naked pumpkin seeds.\"The versatile, nutrient-rich seed is especially well-liked in Mexico and Central America.<\/p>"}}},"block_order":["template--15291250016349__d767a08c-c125-438f-9f72-7cd51abe473c-1665156877c07d7099-0","template--15291250016349__d767a08c-c125-438f-9f72-7cd51abe473c-1665156877c07d7099-1"],"settings":{"padding_top":0,"padding_bottom":100}},"5cbe206a-8974-430b-ab53-0d3a9890d088":{"type":"simple_text","blocks":{"template--15389620011101__5cbe206a-8974-430b-ab53-0d3a9890d088-1673004137a8fb07c4-0":{"type":"heading","settings":{"heading":"Side Effects & Safety"}},"template--15389620011101__5cbe206a-8974-430b-ab53-0d3a9890d088-1673004137a8fb07c4-1":{"type":"text","settings":{"text":"<p>Eaten in moderation, pumpkin seeds are generally regarded as safe. Pumpkin seeds, however, can cause an allergic reaction in some people. Avoid eating pumpkin seeds if you have a known allergy to squash or other members of the same family of plants.<br\/><br\/>Additionally, pumpkin seed oil is generally ok to eat. When taking supplements containing pumpkin seed oil, some people may experience nausea. Consult your doctor and stop taking the supplement if you experience any side effects.<br\/><br\/>Due to their high alpha-linolenic acid (ALA) content, pumpkin seeds should be avoided by pregnant women and young children. Omega-3 fatty acids, which ALA can transform into, may increase the risk of preterm birth and low birth weight.<br\/><\/p><p>Despite being generally safe to eat, pumpkin seeds should only be eaten occasionally. Any food consumed in excess can result in weight gain and other health issues. To get the most benefit from your diet, as with all foods, it's best to eat a variety of foods.<br\/><\/p>"}}},"block_order":["template--15389620011101__5cbe206a-8974-430b-ab53-0d3a9890d088-1673004137a8fb07c4-0","template--15389620011101__5cbe206a-8974-430b-ab53-0d3a9890d088-1673004137a8fb07c4-1"],"settings":{"padding_top":40,"padding_bottom":52}},"c23c9903-1d44-4abb-905d-51478af2e3ea":{"type":"simple_text","blocks":{"template--15389620011101__c23c9903-1d44-4abb-905d-51478af2e3ea-1673004153f6a3b721-0":{"type":"heading","settings":{"heading":"Research Evidence"}},"template--15389620011101__c23c9903-1d44-4abb-905d-51478af2e3ea-1673004153f6a3b721-1":{"type":"text","settings":{"text":"<p>1. Heart Health<br\/>Pumpkin seeds might be beneficial for heart health. In one study, participants with mild hypertension who took a daily supplement of pumpkin seed oil for 12 weeks saw a significant reduction in blood pressure. A mineral called magnesium, which is abundant in pumpkin seeds, is linked to a lower risk of developing heart disease.<br\/><br\/>2. Diabetes <br\/>People with diabetes may benefit from better blood sugar management thanks to pumpkin seeds. According to one study, men with type 2 diabetes who took a daily supplement of pumpkin seed powder for 12 weeks had significantly better blood sugar control. Another study found that type 2 diabetic women who consumed two tablespoons of pumpkin seeds daily for three months experienced improved blood sugar control and decreased insulin resistance. <\/p><p><\/p><p>3. Losing Weight<br\/>Weight loss may be assisted by pumpkin seeds. According to one study, taking a daily supplement of pumpkin seed oil for 12 weeks helped obese people significantly reduce their body weight and body fat. According to a different study, postmenopausal women who consumed two tablespoons of pumpkin seeds daily for a period of 12 weeks significantly reduced their body fat and waist circumference. Fiber from foods like pumpkin seeds may aid in weight loss by increasing feelings of fullness and lowering calorie intake.<br\/><\/p><p>4. Cancer<br\/>There may be an anticancer effect of pumpkin seeds. According to one study, eating pumpkin seeds or pumpkin seed oil raised blood antioxidant levels and decreased prostate cancer cell markers of oxidative stress. According to a different study, taking a daily supplement of pumpkin seed oil for eight weeks caused men with prostate cancer to have significantly lower PSA levels. PSA is a marker for prostate cancer. Beta-carotene, a plant compound that has been associated with a lower risk of several types of cancer, is also present in pumpkin seeds in significant amounts.<br\/><\/p><p>5. Inflammation<br\/><br\/>Inflammation may be decreased with the aid of pumpkin seeds. According to one study, those with metabolic syndrome who took a daily supplement of pumpkin seed oil for eight weeks had significantly lower levels of inflammatory markers. A good source of magnesium, which has been shown to lessen inflammation, is also found in pumpkin seeds.<br\/><br\/>6. Kidney Stones<br\/>Kidney stones may be avoided with the aid of pumpkin seeds. According to one study, taking a daily supplement of pumpkin seed oil for 12 weeks significantly decreased the development of calcium oxalate crystals, a significant contributor to kidney stones. Magnesium, which has been shown to lower the risk of kidney stones, is also present in pumpkin seeds in significant amounts.<br\/><\/p><p>7. Anemia<br\/>Anemia treatment may benefit from pumpkin seeds. According to one study, women with anemia who took a daily supplement of pumpkin seed powder for eight weeks experienced a significant improvement in their iron status. Iron, which is necessary for the treatment of anemia, is present in pumpkin seeds in good amounts.<br\/><br\/>8. Osteoporosis<br\/>Osteoporosis risk may be lowered by eating pumpkin seeds. According to one study, postmenopausal women's bone mineral density increased significantly after taking a daily supplement of pumpkin seed powder for eight weeks. Additionally, magnesium, which has been shown to lower the risk of osteoporosis, is abundant in pumpkin seeds.<br\/><\/p><p>9. The condition Alzheimer's<\/p><p>Pumpkin seeds might lower the likelihood of developing Alzheimer's disease.According to one study, taking a daily supplement of pumpkin seed powder for eight weeks helped postmenopausal women's memory and cognitive function significantly.Zinc, which has been connected to a lower risk of Alzheimer's disease, can be found in pumpkin seeds.<\/p><p><\/p><p>10. Depression<br\/><br\/>Pumpkin seeds may be useful in easing depression's symptoms. In one study, postmenopausal women who took a daily supplement of pumpkin seed oil for eight weeks saw a significant improvement in their depressive symptoms. Magnesium, which has been shown to lower the risk of depression, is also present in pumpkin seeds in significant amounts.<br\/><br\/>Pumpkin seeds are a good source of many nutrients, some of which may be beneficial to health. Inflammation may be reduced, kidney stones may be avoided, and blood sugar regulation may be improved with pumpkin seeds. Additionally, pumpkin seeds may lessen the effects of depression and help with anemia treatment.<br\/><br\/><br\/><\/p><p><\/p>"}}},"block_order":["template--15389620011101__c23c9903-1d44-4abb-905d-51478af2e3ea-1673004153f6a3b721-0","template--15389620011101__c23c9903-1d44-4abb-905d-51478af2e3ea-1673004153f6a3b721-1"],"settings":{"padding_top":40,"padding_bottom":52}}},"order":["main","e2b7edc1-d652-4618-b007-0003c3d77ed7","d767a08c-c125-438f-9f72-7cd51abe473c","5cbe206a-8974-430b-ab53-0d3a9890d088","c23c9903-1d44-4abb-905d-51478af2e3ea"]}