{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28,"alignment_title":"left"}},"e2b7edc1-d652-4618-b007-0003c3d77ed7":{"type":"hero-section-3","blocks":{"template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-0":{"type":"heading","settings":{"heading":"Oat Beta-D-Glucan","heading_size":"medium","show_line":false}},"template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-1":{"type":"text","settings":{"text":"The oat bran contains oat beta-d-glucan. Many of the health advantages of oats can be attributed to this insoluble fiber. Oat beta-d-glucan, when consumed, creates a gel-like substance in the intestine that reduces the rate at which glucose and cholesterol are absorbed. By doing this, you may be able to control your body's levels of cholesterol and blood sugar. The health advantages of oat beta-d-glucan are numerous. It has been demonstrated that this soluble fiber lowers cholesterol, lowers the risk of heart disease, and stabilizes blood sugar. Oat beta-d-glucan may also assist in preserving a healthy weight and enhancing digestive health. Users of Welzo should read this article for informational purposes to better understand oat beta-D-glucan."}},"3697b572-00b3-4873-aadb-01e85df03254":{"type":"button","settings":{"button_label":"Overview","button_link":""}},"c39256d7-f8c0-462f-9109-cc5c53138458":{"type":"button","settings":{"button_label":"Uses","button_link":""}},"e1738aef-38ac-4846-bb48-4dbbbbed5d87":{"type":"button","settings":{"button_label":"Side Effects","button_link":""}},"02803003-6821-40cf-95ac-12d635aeedde":{"type":"button","settings":{"button_label":"Medication","button_link":""}},"6dd2932b-340e-4452-9c4a-96e1a9b89318":{"type":"button","settings":{"button_label":"Ingredients","button_link":""}},"7cfda700-4c13-4a17-9f5a-f70032e2217f":{"type":"button","settings":{"button_label":"Supplements","button_link":""}},"9507a9fe-9b42-4083-bc48-a0a94b4ace7a":{"type":"button","settings":{"button_label":"Pharmacokinetics","button_link":""}},"template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-3":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/image-248-1024x575.png"}}},"block_order":["template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-0","template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-1","3697b572-00b3-4873-aadb-01e85df03254","c39256d7-f8c0-462f-9109-cc5c53138458","e1738aef-38ac-4846-bb48-4dbbbbed5d87","02803003-6821-40cf-95ac-12d635aeedde","6dd2932b-340e-4452-9c4a-96e1a9b89318","7cfda700-4c13-4a17-9f5a-f70032e2217f","9507a9fe-9b42-4083-bc48-a0a94b4ace7a","template--15291250016349__e2b7edc1-d652-4618-b007-0003c3d77ed7-16651460428fa33091-3"],"settings":{"body_text":"#12022f","padding_top":36,"padding_bottom":150}},"d767a08c-c125-438f-9f72-7cd51abe473c":{"type":"simple_text","blocks":{"template--15291250016349__d767a08c-c125-438f-9f72-7cd51abe473c-1665156877c07d7099-0":{"type":"heading","settings":{"heading":"What is Oat Beta-D-Glucan?"}},"template--15291250016349__d767a08c-c125-438f-9f72-7cd51abe473c-1665156877c07d7099-1":{"type":"text","settings":{"text":"<p>The advantages of oat beta-d-glucan for health have been the subject of numerous studies. According to one study, eating foods containing oat beta-d-glucan resulted in lower levels of total and LDL cholesterol. The risk of developing heart disease was also reduced in those who consumed oat beta-d-glucan.<br\/><br\/>Oat beta-d-glucan was demonstrated to be efficient in lowering glucose absorption in the intestine in another study. In diabetics, this action may help control blood sugar levels. Oat beta-d-glucan can also support maintaining a healthy weight. This is due to the fact that this soluble fiber may contribute to the feeling of fullness, which may result in a decrease in calorie intake.<br\/><br\/>The digestive system is also thought to benefit from oat beta-d-glucan. This soluble fiber can contribute to the stool's bulk, which can help make it easier for the intestines to pass through. Additionally, oat beta-d-glucan can aid in the intestine's ability to trap toxins and bacteria, which can improve digestive health.<br\/><br\/>There are numerous advantages to oat beta-d-glucan'shealth. It has been demonstrated that this soluble fiber lowers cholesterol, lowers the risk of heart disease, and stabilizes blood sugar. Oat beta-d-glucan may also assist in preserving a healthy weight and enhancing digestive health. Consider including oat beta-d-glucan in your diet if you're looking for a way to enhance your general health.<br\/><br\/><br\/><br\/> <\/p>"}}},"block_order":["template--15291250016349__d767a08c-c125-438f-9f72-7cd51abe473c-1665156877c07d7099-0","template--15291250016349__d767a08c-c125-438f-9f72-7cd51abe473c-1665156877c07d7099-1"],"settings":{"padding_top":0,"padding_bottom":100}},"5cbe206a-8974-430b-ab53-0d3a9890d088":{"type":"simple_text","blocks":{"template--15389620011101__5cbe206a-8974-430b-ab53-0d3a9890d088-1673004137a8fb07c4-0":{"type":"heading","settings":{"heading":"Pharmacokinetics"}},"template--15389620011101__5cbe206a-8974-430b-ab53-0d3a9890d088-1673004137a8fb07c4-1":{"type":"text","settings":{"text":"<p>Beta-D-glucan is quickly broken down in the digestive tract after oral administration into smaller oligosaccharides and monosaccharides. Beta-D-glucan is not absorbed whole; instead, enterocytes take up its breakdown products through active transport mechanisms. Beta-D-glucans are thought to be able to cross the basolateral membrane once they are inside the enterocyte and enter the bloodstream, where they can interact with different immune system cells.<br\/><br\/>Up to 80% of oat beta-D-glucan has been reported to be bioavailable in people. Within 24 hours, the majority (roughly 50%) of a dose of beta-D-glucan taken orally is eliminated in the feces.<br\/><\/p>"}}},"block_order":["template--15389620011101__5cbe206a-8974-430b-ab53-0d3a9890d088-1673004137a8fb07c4-0","template--15389620011101__5cbe206a-8974-430b-ab53-0d3a9890d088-1673004137a8fb07c4-1"],"settings":{"padding_top":40,"padding_bottom":52}},"c23c9903-1d44-4abb-905d-51478af2e3ea":{"type":"simple_text","blocks":{"template--15389620011101__c23c9903-1d44-4abb-905d-51478af2e3ea-1673004153f6a3b721-0":{"type":"heading","settings":{"heading":"Toxicology"}},"template--15389620011101__c23c9903-1d44-4abb-905d-51478af2e3ea-1673004153f6a3b721-1":{"type":"text","settings":{"text":"<p>In the United States, beta-D-glucans are generally accepted as safe (GRAS) for use as food ingredients. When humans consume up to 30 g\/day of beta-D-glucan from oats or barley, no negative effects have been documented. Large doses of beta-D-glucan (200–500 mg\/kg body weight) have been linked to reduced body weight gain and food intake in animal studies. Beta-D-glucan has also been demonstrated to speed up intestinal transit time and increase stool production at these same doses. The physiochemical characteristics of beta-D-glucan, which raise the viscosity of gastrointestinal contents and lower nutrient absorption, are thought to be responsible for these effects.<br\/><\/p>"}}},"block_order":["template--15389620011101__c23c9903-1d44-4abb-905d-51478af2e3ea-1673004153f6a3b721-0","template--15389620011101__c23c9903-1d44-4abb-905d-51478af2e3ea-1673004153f6a3b721-1"],"settings":{"padding_top":40,"padding_bottom":52}},"72bfe1fd-a8af-4b9c-87e0-49c91e03bfdc":{"type":"simple_text","blocks":{"template--15389620011101__72bfe1fd-a8af-4b9c-87e0-49c91e03bfdc-1673004153f6a3b721-0":{"type":"heading","settings":{"heading":"Clinical Studies"}},"template--15389620011101__72bfe1fd-a8af-4b9c-87e0-49c91e03bfdc-1673004153f6a3b721-1":{"type":"text","settings":{"text":"<p>Numerous clinical studies have been carried out to assess the impact of oat beta-D-glucan on various health markers. Oats beta-D-glucan has been shown in these studies to help lower cholesterol levels, lower the risk of heart disease, and improve glucose tolerance in diabetics. Oat beta-D-glucan may also support the maintenance of a healthy weight.<br\/><br\/>In one investigation, the impact of oat beta-D-glucan on human cholesterol levels was examined. According to this study, people who consumed foods containing oat beta-D-glucan had lower levels of total and LDL cholesterol. A reduction in the risk of developing heart disease was also observed in those who consumed oat beta-D-glucan.<br\/><br\/>Oat beta-D-glucan was found to be effective in lowering glucose absorption in the intestine, according to another study. In diabetics, this action may help control blood sugar levels. Oat beta-D-glucan can also support maintaining a healthy weight. This is due to the fact that this soluble fiber may contribute to the feeling of fullness, which may result in a decrease in calorie intake.<br\/><br\/>Additionally thought to be advantageous for digestive health is oat beta-D-glucan. This soluble fiber can contribute to the stool's bulk, which can help make it easier for the intestines to pass through. Additionally, oat beta-D-glucan can aid in the intestine's ability to trap toxins and bacteria, which can improve digestive health.<br\/><\/p><p>Oat beta-D-glucan has many health advantages. It has been demonstrated that this soluble fiber lowers cholesterol, lowers the risk of heart disease, and stabilizes blood sugar. Oat beta-D-glucan may also assist in preserving a healthy weight and enhancing digestive health. Consider including oat beta-D-glucan in your diet if you're looking for a way to enhance your general health.<br\/><br\/>Oats contain a particular kind of dietary fiber called oat beta glucan. This soluble fiber can lower cholesterol levels, lower the risk of heart disease, and improve glucose tolerance in diabetics, among other health advantages. Oat beta glucan may also support the maintenance of a healthy weight. Think about including this dietary fiber in your diet if you want to enhance your general health. What you should know about oat beta glucan and its potential health advantages is provided below.<br\/><br\/><\/p>"}}},"block_order":["template--15389620011101__72bfe1fd-a8af-4b9c-87e0-49c91e03bfdc-1673004153f6a3b721-0","template--15389620011101__72bfe1fd-a8af-4b9c-87e0-49c91e03bfdc-1673004153f6a3b721-1"],"settings":{"padding_top":40,"padding_bottom":52}},"6f8de598-5300-44af-a06b-04ebf8522782":{"type":"simple_text","blocks":{"template--15389620011101__6f8de598-5300-44af-a06b-04ebf8522782-1673004153f6a3b721-0":{"type":"heading","settings":{"heading":"Benefits"}},"template--15389620011101__6f8de598-5300-44af-a06b-04ebf8522782-1673004153f6a3b721-1":{"type":"text","settings":{"text":"<p>Oat beta glucan has a wide range of potential health advantages. This dietary fiber has been shown to improve glucose tolerance in diabetics and lower cholesterol as well as the risk of heart disease. Oat beta glucan may also support the maintenance of a healthy weight. Here are some of the potential health advantages of this dietary fiber in more detail:<br\/><br\/>Reduces Cholesterol Levels Potentially<br\/>In one investigation, the impact of oat beta glucan on human cholesterol levels was examined. According to this study, people who consumed foods containing oat beta glucan had lower total cholesterol levels than people who did not. Furthermore, those who consumed foods containing oat beta glucan also had lower levels of LDL (\"bad\") cholesterol and higher HDL (“good”) cholesterol levels.<\/p><p>Could Lower Heart Disease Risk<br\/>Oat beta glucan's effects on the risk of heart disease were the subject of another study. According to this study, those who consumed oat beta glucan-containing foods had a lower risk of coronary heart disease than those who did not. The participants who consumed oat beta glucan-rich foods also had a lower risk of passing away from coronary heart disease.<\/p><p>Possibly Boosts Glucose Tolerance<br\/>Numerous studies have examined how oat beta glucan affects glucose tolerance. These studies have demonstrated that this dietary fiber can assist in enhancing glucose tolerance in diabetics. Oat beta glucan may also aid in enhancing insulin sensitivity.<\/p><p>Might Aid You in Retaining a Healthy Weight<br\/>Consider including oat beta glucan in your diet if you're trying to stay at a healthy weight. It has been demonstrated that this dietary fiber increases satiety, which can help you feel fuller for longer and avoid overeating. Additionally, oat beta glucan may aid in slowing the bloodstream's absorption of sugar, which can prevent blood sugar spikes.<\/p><p><br\/>Might Enhance Immunity<br\/>Consider including oat beta glucan in your diet if you're looking for a way to strengthen your defenses. It has been demonstrated that this dietary fiber stimulates the activity of natural killer cells, a class of white blood cells that aids in the defense against infection. Oat beta glucan may additionally aid in lowering the intensity and duration of colds and other respiratory infections.<br\/><\/p>"}}},"block_order":["template--15389620011101__6f8de598-5300-44af-a06b-04ebf8522782-1673004153f6a3b721-0","template--15389620011101__6f8de598-5300-44af-a06b-04ebf8522782-1673004153f6a3b721-1"],"settings":{"padding_top":40,"padding_bottom":52}},"93eb9989-e47c-4d6c-80f4-177eca3c1cf1":{"type":"simple_text","blocks":{"template--15389620011101__93eb9989-e47c-4d6c-80f4-177eca3c1cf1-1673004153f6a3b721-0":{"type":"heading","settings":{"heading":"How Do I Add Oat Beta Glucan to My Diet?"}},"template--15389620011101__93eb9989-e47c-4d6c-80f4-177eca3c1cf1-1673004153f6a3b721-1":{"type":"text","settings":{"text":"<p>Oats contain oat beta glucan. By eating oatmeal or including oats in your baking, you can increase the amount of dietary fiber in your diet. Oat beta glucan is also present in many commercially available items, including oat bran, oat flour, and oat cereal.<br\/><br\/>Think about incorporating oat beta glucan into your diet if you're looking for a way to enhance your general health. This dietary fiber is simple to incorporate into your diet and may have a number of health advantages. Before incorporating any new supplement into your regimen, you should consult your doctor.<br\/><\/p>"}}},"block_order":["template--15389620011101__93eb9989-e47c-4d6c-80f4-177eca3c1cf1-1673004153f6a3b721-0","template--15389620011101__93eb9989-e47c-4d6c-80f4-177eca3c1cf1-1673004153f6a3b721-1"],"settings":{"padding_top":40,"padding_bottom":52}},"ab0abf89-fae6-4c67-84a5-9c9af026a7c7":{"type":"simple_text","blocks":{"template--15395563667549__ab0abf89-fae6-4c67-84a5-9c9af026a7c7-167360843568a67daf-0":{"type":"heading","settings":{"heading":"Possible Side Effects"}},"template--15395563667549__ab0abf89-fae6-4c67-84a5-9c9af026a7c7-167360843568a67daf-1":{"type":"text","settings":{"text":"<p>In general, OAT-B-GLUCAN is well tolerated. GI symptoms like bloating, gas, and diarrhea are the most typical side effects. Typically, these side effects are minor and transient. Please speak with your healthcare provider if you experience any negative side effects that are severe or persistent.<br\/><\/p>"}}},"block_order":["template--15395563667549__ab0abf89-fae6-4c67-84a5-9c9af026a7c7-167360843568a67daf-0","template--15395563667549__ab0abf89-fae6-4c67-84a5-9c9af026a7c7-167360843568a67daf-1"],"settings":{"padding_top":40,"padding_bottom":52}},"a4a2491e-65d7-4927-9c2c-f7bc55715946":{"type":"simple_text","blocks":{"6e1a4d24-c058-4560-b050-3ef70951713e":{"type":"heading","settings":{"heading":"Drug Interactions"}},"4bb09b1c-2f21-497a-b744-349a58e6cf1a":{"type":"text","settings":{"text":"<p>There could be drug interactions with OAT-B-GLUCAN. Before taking OAT-B-GLUCAN, please check with your healthcare provider if you are taking any other medications.<br\/><\/p>"}}},"block_order":["6e1a4d24-c058-4560-b050-3ef70951713e","4bb09b1c-2f21-497a-b744-349a58e6cf1a"],"settings":{"padding_top":40,"padding_bottom":52}},"6f8ea336-bbea-4026-9a0b-fd84dc420205":{"type":"simple_text","blocks":{"template--15395563667549__6f8ea336-bbea-4026-9a0b-fd84dc420205-1673608572265fdcfc-0":{"type":"heading","settings":{"heading":"Pregnancy and Lactation"}},"template--15395563667549__6f8ea336-bbea-4026-9a0b-fd84dc420205-1673608572265fdcfc-1":{"type":"text","settings":{"text":"<p>The use of OAT-B-GLUCAN during pregnancy or lactation is not advised. If you are pregnant or nursing, please talk to your doctor before taking OAT-B-GLUCAN.<br\/><\/p>"}}},"block_order":["template--15395563667549__6f8ea336-bbea-4026-9a0b-fd84dc420205-1673608572265fdcfc-0","template--15395563667549__6f8ea336-bbea-4026-9a0b-fd84dc420205-1673608572265fdcfc-1"],"settings":{"padding_top":40,"padding_bottom":52}},"ea156532-6aa7-41f8-a40f-1727cae863ad":{"type":"simple_text","blocks":{"template--15395563667549__ea156532-6aa7-41f8-a40f-1727cae863ad-1673608572265fdcfc-0":{"type":"heading","settings":{"heading":"Dosage and Administration"}},"template--15395563667549__ea156532-6aa7-41f8-a40f-1727cae863ad-1673608572265fdcfc-1":{"type":"text","settings":{"text":"<p>OAT-B-GLUCAN should be taken in doses of 3 grams per day with meals. Divide your daily dosage into 2 or 3 smaller doses, and take with meals for best results. Before taking OAT-B-GLUCAN, please check with your healthcare provider if you are taking any other medications.<br\/><\/p>"}}},"block_order":["template--15395563667549__ea156532-6aa7-41f8-a40f-1727cae863ad-1673608572265fdcfc-0","template--15395563667549__ea156532-6aa7-41f8-a40f-1727cae863ad-1673608572265fdcfc-1"],"settings":{"padding_top":40,"padding_bottom":52}},"956abe7f-1ea9-470b-8ad8-6cbbff90c3f3":{"type":"simple_text","blocks":{"template--15395563667549__956abe7f-1ea9-470b-8ad8-6cbbff90c3f3-1673608696e9986a71-0":{"type":"heading","settings":{"heading":"Storage"}},"template--15395563667549__956abe7f-1ea9-470b-8ad8-6cbbff90c3f3-1673608696e9986a71-1":{"type":"text","settings":{"text":"<p>Store away from children in a cool, dry location. If the seal is damaged or missing, do not use.<br\/><\/p>"}}},"block_order":["template--15395563667549__956abe7f-1ea9-470b-8ad8-6cbbff90c3f3-1673608696e9986a71-0","template--15395563667549__956abe7f-1ea9-470b-8ad8-6cbbff90c3f3-1673608696e9986a71-1"],"settings":{"padding_top":40,"padding_bottom":52}}},"order":["main","e2b7edc1-d652-4618-b007-0003c3d77ed7","d767a08c-c125-438f-9f72-7cd51abe473c","5cbe206a-8974-430b-ab53-0d3a9890d088","c23c9903-1d44-4abb-905d-51478af2e3ea","72bfe1fd-a8af-4b9c-87e0-49c91e03bfdc","6f8de598-5300-44af-a06b-04ebf8522782","93eb9989-e47c-4d6c-80f4-177eca3c1cf1","ab0abf89-fae6-4c67-84a5-9c9af026a7c7","a4a2491e-65d7-4927-9c2c-f7bc55715946","6f8ea336-bbea-4026-9a0b-fd84dc420205","ea156532-6aa7-41f8-a40f-1727cae863ad","956abe7f-1ea9-470b-8ad8-6cbbff90c3f3"]}