{"sections":{"main":{"type":"main-product2-2-v2","blocks":{"vendor":{"type":"text","disabled":true,"settings":{"text":"{{ product.vendor }}","text_style":"uppercase"}},"caption":{"type":"text","settings":{"text":"{{ product.metafields.descriptors.subtitle.value }}","text_style":"subtitle"}},"aa179a48-7907-4821-9ca6-c85371cd7a9f":{"type":"highlights","disabled":true,"settings":{}},"collapsible-row-0":{"type":"collapsible_tab","disabled":true,"settings":{"heading":"Materials","icon":"leather","content":"","page":""}},"collapsible-row-1":{"type":"collapsible_tab","disabled":true,"settings":{"heading":"Shipping & Returns","icon":"truck","content":"","page":""}},"collapsible-row-2":{"type":"collapsible_tab","disabled":true,"settings":{"heading":"Dimensions","icon":"ruler","content":"","page":""}},"collapsible-row-3":{"type":"collapsible_tab","disabled":true,"settings":{"heading":"Care Instructions","icon":"heart","content":"","page":""}},"share":{"type":"share","disabled":true,"settings":{"share_label":"Share"}},"d47fd3c2-ccba-464f-8c42-9454300acf2e":{"type":"shopify:\/\/apps\/rebuy-personalization-engine\/blocks\/rebuy-widget\/a26ae9b9-933b-40bf-bbc6-bf1220bbc4dc","settings":{"enabled":true,"id":"97948","product_id_enabled":true,"collection_id_enabled":false}},"c4c9eecc-603f-4dd0-a04a-f35968db266c":{"type":"shopify:\/\/apps\/rebuy-personalization-engine\/blocks\/rebuy-widget\/a26ae9b9-933b-40bf-bbc6-bf1220bbc4dc","settings":{"enabled":true,"id":"97947","product_id_enabled":true,"collection_id_enabled":false}}},"block_order":["vendor","caption","aa179a48-7907-4821-9ca6-c85371cd7a9f","collapsible-row-0","collapsible-row-1","collapsible-row-2","collapsible-row-3","share","d47fd3c2-ccba-464f-8c42-9454300acf2e","c4c9eecc-603f-4dd0-a04a-f35968db266c"],"settings":{"enable_sticky_info":true,"enable_reviews":true,"enable_reviews_rat":true,"image_reviews":"shopify:\/\/shop_images\/cheerful-guy-enjoying-outdoor-coffee-break_1.png","name_reviews":"Hugo Dover","text_reviews":"Received the medical certificate within 30 minutes. Amazing service!","image_reviews2":"shopify:\/\/shop_images\/beautiful-young-woman-lying-side-lake-park_1.png","name_reviews2":"Elina Goulliard","text_reviews2":"Used the Welzo medical letter to cancel my gym membership, was quick and easy to complete!","image_reviews3":"shopify:\/\/shop_images\/woman-relaxing-bath-with-tropical-flowers-outdoor-luxury-hotel_1.png","name_reviews3":"Elizabeth Moore","text_reviews3":"Excellent service, have used Welzo multiple times now for travel and work related certificates.","enable_delivery":true,"picker_type":"button","enable_quantity":true,"show_dynamic_checkout":false,"enable_payment_i":true,"enable_news_l":true,"image_news1":"shopify:\/\/shop_images\/The_Daily_Mirror_logo.png","image_news2":"shopify:\/\/shop_images\/yahoo_01d90440-d295-40e7-9266-347e0db579ff.png","image_news3":"shopify:\/\/shop_images\/bbc_1d5ebdf6-f9d9-4ac5-bd58-9216009fa97d.png","image_news4":"shopify:\/\/shop_images\/metro_1.png","enable_benefit":true,"benefit_icon1":"icon-locate","benefit_title1":"UK & Global {{ product.title }}","benefit_text1":"Use Welzo's medical certificates for use in the UK, EU, USA and internationally.","benefit_icon2":"icon-message","benefit_title2":"Fully digital service","benefit_text2":"Complete the medical certificates digitally online without needing to book an appointment.","benefit_icon3":"icon-truck2","benefit_title3":"{{ product.title }} within 1 hour","benefit_text3":"We are proud to be the UK's fastest medical certificate and letter service.","benefit_icon4":"icon-star","benefit_title4":"We’re rated 4.9 out of 5","benefit_text4":"Based on over 24,000+ reviews on Trustindex, Trustpilot and Google.","gallery_layout":"stacked","media_size":"medium","mobile_thumbnails":"hide","hide_variants":false,"enable_video_looping":false,"padding_top":34,"padding_bottom":12}},"product-recommendations":{"type":"product-recommendations","disabled":true,"settings":{"heading":"You may also like","color_scheme":"background-1","image_ratio":"square","show_secondary_image":true,"show_vendor":false,"show_rating":false,"padding_top":36,"padding_bottom":28}},"1654193691dfa28cc9":{"type":"how2","settings":{"image_background":"shopify:\/\/shop_images\/why-bg.png","title":"How to order a {{ product.title }}","title1":"Checkout online","text1":"<p>Add your {{ product.title }} to the cart and checkout securely using our express checkout online. <\/p>","title2":"Fill out online form","text2":"<p>Once you checkout online, we will send you a form to complete to receive your {{ product.title }}.<\/p>","title3":"Receive your {{ product.title }}","text3":"<p>We will email you a digital PDF of your {{ product.title }} which can be downloaded or printed for use. <\/p>","padding_top":36,"padding_bottom":36}},"97481e6c-22b0-4cec-9542-f5bd930868b2":{"type":"simple_text","blocks":{"template--15460049616989__97481e6c-22b0-4cec-9542-f5bd930868b2-1682876312ae12cace-0":{"type":"heading","settings":{"heading":"Order a {{ product.title }} Online"}},"8b12789f-42f8-43bb-8b0a-e47ae5cce0c0":{"type":"text","settings":{"text":"<h3><strong>Welcome to Welzo: Your Trusted Source for ordering<\/strong><strong>{{ product.title }}<\/strong><\/h3><h3>How do I order a {{ product.title }}?<\/h3><p>Ordering a {{ product.title }} has never been more straight forward. <\/p><ol><li>Simply checkout online  using our secure checkout. <\/li><li>Fill out the questionnaire and documents we send to you via email after checking out<\/li><li>Receive your Doctor's certified PDF certificate straight to your inbox via email. <br\/><\/li><\/ol><h3>What is a {{ product.title }}?<\/h3><p>A {{ product.title }} issued by Welzo.com is an electronically generated document that verifies a person's medical condition or status, based on the professional opinion of a registered doctor. This {{ product.title }}contains essential information, such as the individual's health condition, the duration of rest or leave recommended (if applicable), and the name and signature of the issuing doctor. It serves as an official attestation of health-related matters, delivered in a convenient, digital format.<\/p><h3>How do I get a {{ product.title }}?<\/h3><p>To secure a {{ product.title }} from Welzo.com, you first need to visit the Welzo.com website. There, you'll find clear guidelines about the process involved. The website likely includes an online form or system through which you can request the certificate. This will involve inputting relevant details such as your name, contact information, and specifics about your medical situation. The certificate is usually generated and delivered electronically after a registered UK doctor has reviewed and signed off on your information. It's essential to provide accurate information during this process because providing misleading or false information can lead to legal consequences.<\/p><h3>Where can I use my {{ product.title }}?<\/h3><p>The uses of a digital medical certificate issued by Welzo.com are manifold. You can use it as a formal excuse for work absence due to illness. It might also be required by educational institutions in the case of student illness. Moreover, the certificate can serve as proof of a medical condition for legal purposes or for insurance claims. However, the acceptance of a digital medical certificate can vary depending on the rules and policies of the receiving institution, so it's advisable to verify in advance whether a digital format will be accepted.<\/p><h3>Is the {{ product.title }} signed by a doctor?<\/h3><p>Yes, the {{ product.title }} issued by Welzo.com is indeed signed by a doctor. In fact, all the certificates from Welzo.com are signed by doctors registered in the UK. Their professional standing and credentials give legitimacy and legal bearing to these documents.<\/p><h3>Can I get a {{ product.title }} from my GP?<\/h3><p>No, a {{ product.title }} from Welzo.com can only be obtained through their online platform. Your GP may issue a medical certificate, but it would not be a Welzo.com certificate. However, the information your GP provides could be used in the process of obtaining a Welzo.com certificate, provided that you have your GP's consent to share that information.<\/p><h3>How do I write a {{ product.title }}?<\/h3><p>As a patient, you don't need to write your own {{ product.title }}. At Welzo.com, the certificate is generated based on the information you provide during the order process, and it's then written and signed off by a registered doctor. It's important to provide accurate and honest information during this process to ensure the certificate accurately reflects your health status.<br\/><\/p><h3><br\/>Can I use the {{ product.title }} to cancel a contract?<br\/><\/h3><p><br\/>Whether you can use a {{ product.title }} from Welzo.com to cancel a contract depends on the specific terms and conditions of the contract itself. Some contracts include clauses that allow for cancellation or modification due to health reasons, in which case a medical certificate could potentially be used. However, the specifics can vary widely, so you should review your contract carefully or consult with a legal expert to understand your options. It's also important to check whether the organisation or institution accepts digital medical certificates for this purpose.<\/p>"}}},"block_order":["template--15460049616989__97481e6c-22b0-4cec-9542-f5bd930868b2-1682876312ae12cace-0","8b12789f-42f8-43bb-8b0a-e47ae5cce0c0"],"settings":{"padding_top":40,"padding_bottom":20}},"692d8027-9041-4a53-a4dc-81ef6b2c317e":{"type":"simple_text","blocks":{"template--15460049616989__692d8027-9041-4a53-a4dc-81ef6b2c317e-1682942944fffb7e10-0":{"type":"heading","settings":{"heading":""}}},"block_order":["template--15460049616989__692d8027-9041-4a53-a4dc-81ef6b2c317e-1682942944fffb7e10-0"],"settings":{"padding_top":20,"padding_bottom":36}},"385eb90e-125d-44ba-a9bf-2fe8c835ea03":{"type":"featured-collection","settings":{"title":"Popular Medical Letters & Certificates","featured_collection_id":"","collection":"medical-certificate","products_to_show":4,"color_scheme":"background-1","show_view_all":true,"swipe_on_mobile":false,"image_ratio":"adapt","show_secondary_image":false,"show_vendor":false,"show_rating":false,"padding_top":36,"padding_bottom":36}},"165346922221a5012f":{"type":"faq","blocks":{"1653469222a4a027b4-0":{"type":"column","settings":{"title":"Specific","text":""}},"7246161a-a3c2-4391-aff6-bdbcffa3cdb5":{"type":"column","settings":{"title":"Specific","text":""}},"b37db117-cfe4-49e7-9cba-127f78875786":{"type":"column","settings":{"title":"Specific","text":""}},"05bf8b0d-14d4-4b22-bcab-ce5c7d6a76eb":{"type":"column","settings":{"title":"Specific","text":""}},"8c2be819-f783-49fc-befe-414ccd39d703":{"type":"column","settings":{"title":"What is a {{ product.title }}?","text":"<p>A {{ product.title }}, also referred to as an electronic medical certificate or a medical letter, is a formal document that verifies an individual's health condition or disability, provided electronically by a licensed medical professional.<br\/><br\/>This certificate serves various purposes, such as confirming the need for medical leave from work, proving fitness to participate in specific activities, or providing evidence of a health condition for legal or insurance matters. It might include details about the individual's medical condition, the medical professional's opinion and recommendations, and the duration of the leave or other restrictions, if applicable.<br\/><br\/>The use of digital medical certificates has grown significantly. Not only do they reduce paperwork and simplify processes, but they also facilitate easy sharing of documents between different parties, such as between an employee, an employer, and an insurance company.<br\/><br\/>However, there are also potential challenges and risks associated with digital medical certificates. These include concerns around data privacy and security, as well as the potential for fraud. Therefore, it's critical that these certificates are issued and handled using secure, encrypted channels, and that they have some form of validation or authentication to confirm their legitimacy.<\/p>"}},"24e11988-ce58-4fe8-846c-10a329d7fd8c":{"type":"column","settings":{"title":"Is my data and information safe with a {{ product.title }} service?","text":"<p>Ensuring the safety and privacy of data in a {{ product.title }} or certificate service is of utmost importance due to the sensitive nature of health information. Here are some ways to ensure that records are safe and secure:<\/p><ol><li><strong>Encryption<\/strong>: The data should be encrypted both in transit (as it's being sent between the sender and the receiver) and at rest (when it's stored on a server). This means that even if someone were to intercept the data, they would not be able to understand it without the decryption key.<\/li><li><strong>Secure servers<\/strong>: The servers where the data is stored should be secure and have multiple layers of protection against both physical and cyber threats. This includes using firewalls, secure access controls, and regular security updates and patches.<\/li><li><strong>Two-factor authentication (2FA)<\/strong>: This requires the user to provide two forms of identification before they can access the data. This could be something they know (like a password), something they have (like a mobile device to receive a code), or something they are (like a fingerprint or facial recognition).<\/li><li><strong>Role-based access control (RBAC)<\/strong>: This means that not everyone has the same level of access to the data. The level of access is based on the role of the individual in relation to the data. For instance, a doctor might have full access, while a receptionist might only have access to the patient's contact details.<\/li><li><strong>Regular audits<\/strong>: Regular audits should be conducted to ensure compliance with security standards and to identify any potential vulnerabilities. This should include both internal audits and external audits by independent third parties.<\/li><li><strong>Compliance with regulations<\/strong>: The service should comply with local and international data protection regulations, such as the General Data Protection Regulation (GDPR) in the EU and the Health Insurance Portability and Accountability Act (HIPAA) in the US.<\/li><li><strong>Data anonymisation or pseudonymisation<\/strong>: Where possible, data should be anonymised or pseudonymised. This means that the data is stripped of personally identifiable information or replaced with pseudonyms, making it more difficult for the data to be traced back to an individual.<\/li><li><strong>Education and training<\/strong>: Staff should be trained on the importance of data privacy and how to handle sensitive data. This includes training on how to identify and avoid phishing scams, the importance of strong passwords, and the need to report any suspicious activity.<\/li><li><strong>Data backup and recovery plan<\/strong>: In case of data loss or a security breach, there should be a backup of the data and a plan for how to recover it. This plan should be tested regularly to ensure that it works.<\/li><\/ol>"}},"48abf10e-1d54-4a71-b5be-05e9c0435fe7":{"type":"column","settings":{"title":"What medical evidence do I require for a {{ product.title }}?","text":"<p>We will send specific requirements to you via email regarding the{{ product.title }} :<\/p><p>✓  Upload a photo of your passport or workplace ID<\/p><p>✓ Complete a medical questionnaire for the {{ product.title }}<\/p><p>✓  We will upload any further documents we require<\/p>"}},"b65e598c-af5f-4d72-b40e-ea0e0048856a":{"type":"column","settings":{"title":"Will my {{ product.title }} have a QR?","text":"<p>Each {{ product.title }} issued by Welzo.com will contain a unique Quick Response (QR) code. The QR code is a type of matrix barcode that can store a considerable amount of digital information, including text, URLs, or other data.<\/p><p>In the case of Welzo's {{ product.title }}, the QR code serves as a powerful security measure for verifying the certificate's authenticity. When scanned using a QR code reader (often a feature available on smartphones), it will direct you to a page on the Welzo.com website where the certificate's validity can be verified.<\/p><p>This verification page will confirm the certificate details, including the name of the patient, the issuing medical professional, the certificate's issue date, and other pertinent information as applicable. This confirmation ensures that the certificate is indeed an original issued by Welzo.com and not a counterfeit or tampered document.<\/p><p>The use of a QR code in this way provides an added layer of security, helping to mitigate the risk of fraudulent medical certificates. It also enables instantaneous verification, enhancing the ease of use and convenience for all parties involved.<\/p>"}},"a10c403e-f80c-4e51-8943-f814c5ebd1ec":{"type":"column","settings":{"title":"Do you refund orders for {{ product.title }}?","text":"<p>Welzo.com values its customers and strives to deliver high-quality {{ product.title }} to meet their needs. Due to the nature of these unique digital assets, they are generated immediately upon purchase, and as such, they cannot be returned or resold like a physical item.<\/p><p>This is because a digital medical certificate from Welzo.com is a personalised and unique document that cannot be reused, repurposed, or reassigned. It's created specifically for the individual whose details are provided at the time of the order.<\/p><p>For this reason, Welzo.com does not generally offer refunds once a digital medical certificate has been issued. However, the company understands that sometimes there may be issues or errors with the order. In such cases, if the issue is found to be due to a mistake on Welzo's part, a refund may be granted.<\/p><p>If you believe there is a problem with your order, please get in touch with Welzo's customer service team as soon as possible. They will investigate the matter thoroughly and, if applicable, may offer a resolution in the form of a corrected certificate or, in some cases, a refund.<\/p><p>Please note that all decisions regarding refunds are at the discretion of Welzo.com, and all cases will be handled individually. Remember to carefully check all the details provided when placing your order to avoid any mistakes and ensure the issued certificate meets your needs.<\/p>"}},"10637cb6-1e43-400b-b253-e0a3a7871950":{"type":"column","settings":{"title":"How long will it take to receive the {{ product.title }}?","text":"<p>Welzo.com strives to deliver a fast and efficient service for all customers. As such, in the majority of cases, the {{ product.title }} are issued within 1 hour of the order being placed. This quick turnaround time ensures you receive your document promptly, allowing you to proceed with any related matters without undue delay.<\/p><p>However, please note that in some exceptional situations, the issuance of the {{ product.title }} could take up to 5 hours. This might occur due to factors such as a high volume of orders, the need for additional verification of the information provided, or technical issues.<\/p><p>Rest assured that the team at Welzo.com is committed to providing you with your digital medical certificate as swiftly as possible while ensuring the accuracy and legitimacy of the document. In the event of any delays, we appreciate your patience and understanding.<\/p><p>Once your {{ product.title }} is ready, you will receive it directly via the method you selected during the ordering process. This ensures secure and immediate delivery of the document, ready for you to use as required.<\/p>"}},"f5a4d60e-94fe-4cc3-bbf6-5a0d78841fa6":{"type":"column","settings":{"title":"Who signs the {{ product.title }}?","text":"<p>At Welzo.com, each {{ product.title }} is signed by one of our registered doctors based in the UK. This is a crucial aspect of our service to ensure the authenticity and legitimacy of the {{ product.title }}.<\/p><p>Our team of doctors are all registered with the General Medical Council (GMC), the statutory body that maintains the official register of medical practitioners within the United Kingdom. Their professional qualifications, experience and standing enable them to issue these important documents.<\/p><p>The doctor's signature on your {{ product.title }} is not a mere formality. It essential when receiving your{{ product.title }}. <\/p><p>By having a registered UK doctor sign the {{ product.title }}, you can have confidence in the validity of the document, knowing that it has been issued by a licensed medical professional who is accountable to the stringent standards and guidelines set forth by the GMC.<\/p><p>It is this professional endorsement that gives the {{ product.title }} its legal bearing and acceptability, whether you're using it for work, insurance, legal, or other purposes.<\/p>"}}},"block_order":["1653469222a4a027b4-0","7246161a-a3c2-4391-aff6-bdbcffa3cdb5","b37db117-cfe4-49e7-9cba-127f78875786","05bf8b0d-14d4-4b22-bcab-ce5c7d6a76eb","8c2be819-f783-49fc-befe-414ccd39d703","24e11988-ce58-4fe8-846c-10a329d7fd8c","48abf10e-1d54-4a71-b5be-05e9c0435fe7","b65e598c-af5f-4d72-b40e-ea0e0048856a","a10c403e-f80c-4e51-8943-f814c5ebd1ec","10637cb6-1e43-400b-b253-e0a3a7871950","f5a4d60e-94fe-4cc3-bbf6-5a0d78841fa6"],"settings":{"faq_section_show":true,"title":"Frequently Asked Questions about {{ product.title }}","page_width":1090,"padding_top":32,"padding_bottom":100}},"165419357468920250":{"type":"meet-our-team","blocks":{"1654193574c8ef5a90-0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/image.png","name":"Dr Sameer Nakkedar","profession":"Chief Medical Officer"}},"b6f4ade1-f106-4dc6-90fd-09101e6c2527":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Simona.webp","name":"Simona Ilieva","profession":"UK Chief of Operations"}},"2cbac946-2105-4a01-95a3-8c17b1580b44":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Mahyar_Photo_HQ_PK_copy_29204c4a-37fb-4fe6-97fe-c75f3232bbbd.jpg","name":"Mahyar Nickkho-Amiry","profession":"Lead Pharmacy Partner"}}},"block_order":["1654193574c8ef5a90-0","b6f4ade1-f106-4dc6-90fd-09101e6c2527","2cbac946-2105-4a01-95a3-8c17b1580b44"],"disabled":true,"settings":{"title":"Meet Our Qualified Team","padding_top":100,"padding_bottom":100}},"16534182831dc0cb7b":{"type":"why","blocks":{"1653418283e408e0b5-0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon_5.png","title":"Convenient and fast","text":"<p>Order your {{ product.title }} online without the need for an appointment and get your certificate in under an hour. <\/p>"}},"e902f2b1-2263-43e5-a679-7c1f7648190b":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon_6.png","title":"UK Based Doctors","text":"<p>We only work with UK based Doctors. All of our Doctors are registered with the GMC.<\/p>"}},"8ed7e7d7-cb80-42f0-bff9-9cc2bfa71a75":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon_7.png","title":"Rated 4.9\/5 on Trustindex","text":"<p>We are rated 4.9 out of 5 by over 24,000 customers online. Making us the highest rated online pharmacy in the UK.<\/p>"}}},"block_order":["1653418283e408e0b5-0","e902f2b1-2263-43e5-a679-7c1f7648190b","8ed7e7d7-cb80-42f0-bff9-9cc2bfa71a75"],"settings":{"image_background":"shopify:\/\/shop_images\/base11.jpg","image_logos":"shopify:\/\/shop_images\/logos.png","title":"Express {{ product.title }}","padding_top":100,"padding_bottom":100}},"1682818256a75ee81a":{"type":"apps","blocks":{"3f9a2702-4576-47cd-acfa-2f10b4690c04":{"type":"shopify:\/\/apps\/judge-me-reviews\/blocks\/review_widget\/61ccd3b1-a9f2-4160-9fe9-4fec8413e5d8","settings":{}}},"block_order":["3f9a2702-4576-47cd-acfa-2f10b4690c04"],"settings":{"include_margins":true}},"7dba965f-2f07-426b-8cb0-0d986606d5d3":{"type":"multicolumn","blocks":{"template--15460049616989__7dba965f-2f07-426b-8cb0-0d986606d5d3-168296890729ea5f21-0":{"type":"column","settings":{"title":"","text":"{{ product.metafields.custom.related_services | metafield_tag }}","link_label":"","link":""}},"template--15460049616989__7dba965f-2f07-426b-8cb0-0d986606d5d3-168296890729ea5f21-1":{"type":"column","settings":{"title":"","text":"{{ product.metafields.custom.related_articles | metafield_tag }}","link_label":"","link":""}}},"block_order":["template--15460049616989__7dba965f-2f07-426b-8cb0-0d986606d5d3-168296890729ea5f21-0","template--15460049616989__7dba965f-2f07-426b-8cb0-0d986606d5d3-168296890729ea5f21-1"],"settings":{"title":"","image_width":"full","image_ratio":"adapt","column_alignment":"left","background_style":"primary","button_label":"","button_link":"","swipe_on_mobile":false,"color_scheme":"background-1","padding_top":36,"padding_bottom":36}},"112a8910-6f6d-4733-83c3-663dc43141f8":{"type":"simple_text","blocks":{"template--15460049616989__112a8910-6f6d-4733-83c3-663dc43141f8-1682904017dcb3e43e-0":{"type":"heading","settings":{"heading":""}},"template--15460049616989__112a8910-6f6d-4733-83c3-663dc43141f8-1682904017dcb3e43e-1":{"type":"text","settings":{"text":"{{ product.metafields.custom.text1 | metafield_tag }}"}}},"block_order":["template--15460049616989__112a8910-6f6d-4733-83c3-663dc43141f8-1682904017dcb3e43e-0","template--15460049616989__112a8910-6f6d-4733-83c3-663dc43141f8-1682904017dcb3e43e-1"],"settings":{"padding_top":40,"padding_bottom":52}}},"order":["main","product-recommendations","1654193691dfa28cc9","97481e6c-22b0-4cec-9542-f5bd930868b2","692d8027-9041-4a53-a4dc-81ef6b2c317e","385eb90e-125d-44ba-a9bf-2fe8c835ea03","165346922221a5012f","165419357468920250","16534182831dc0cb7b","1682818256a75ee81a","7dba965f-2f07-426b-8cb0-0d986606d5d3","112a8910-6f6d-4733-83c3-663dc43141f8"]}