{"sections":{"main":{"type":"main-product2-2-v2","blocks":{"vendor":{"type":"text","disabled":true,"settings":{"text":"{{ product.vendor }}","text_style":"uppercase"}},"caption":{"type":"text","settings":{"text":"{{ product.metafields.descriptors.subtitle.value }}","text_style":"subtitle"}},"aa179a48-7907-4821-9ca6-c85371cd7a9f":{"type":"highlights","disabled":true,"settings":{}},"collapsible-row-0":{"type":"collapsible_tab","disabled":true,"settings":{"heading":"Materials","icon":"leather","content":"","page":""}},"collapsible-row-1":{"type":"collapsible_tab","disabled":true,"settings":{"heading":"Shipping & Returns","icon":"truck","content":"","page":""}},"collapsible-row-2":{"type":"collapsible_tab","disabled":true,"settings":{"heading":"Dimensions","icon":"ruler","content":"","page":""}},"collapsible-row-3":{"type":"collapsible_tab","disabled":true,"settings":{"heading":"Care Instructions","icon":"heart","content":"","page":""}},"share":{"type":"share","disabled":true,"settings":{"share_label":"Share"}}},"block_order":["vendor","caption","aa179a48-7907-4821-9ca6-c85371cd7a9f","collapsible-row-0","collapsible-row-1","collapsible-row-2","collapsible-row-3","share"],"settings":{"enable_sticky_info":true,"enable_reviews":true,"enable_reviews_rat":true,"image_reviews":"shopify:\/\/shop_images\/cheerful-guy-enjoying-outdoor-coffee-break_1.png","name_reviews":"Hugo Dover","text_reviews":"The fastest delivery of any online pharmacy. Used 3 times, each order arrived the next day before 12:00","image_reviews2":"shopify:\/\/shop_images\/beautiful-young-woman-lying-side-lake-park_1.png","name_reviews2":"Elina Goulliard","text_reviews2":"Reliable & original products, with fast next day delivery. Have been using Welzo for over a year now.","image_reviews3":"shopify:\/\/shop_images\/woman-relaxing-bath-with-tropical-flowers-outdoor-luxury-hotel_1.png","name_reviews3":"Elizabeth Moore","text_reviews3":"Welzo is the only online pharmacy I trust, lots of support from customer service who are easy to get a hold of and quick delivery.","enable_delivery":true,"picker_type":"button","enable_quantity":true,"show_dynamic_checkout":false,"enable_payment_i":true,"enable_news_l":true,"image_news1":"shopify:\/\/shop_images\/The_Daily_Mirror_logo.png","image_news2":"shopify:\/\/shop_images\/yahoo_01d90440-d295-40e7-9266-347e0db579ff.png","image_news3":"shopify:\/\/shop_images\/bbc_1d5ebdf6-f9d9-4ac5-bd58-9216009fa97d.png","image_news4":"shopify:\/\/shop_images\/metro_1.png","enable_benefit":true,"benefit_icon1":"icon-locate","benefit_title1":"100% UK-based pharmacies","benefit_text1":"Our team of doctors, network of pharmacy suppliers and our support staff, are all UK-based.","benefit_icon2":"icon-message","benefit_title2":"Free advice and support","benefit_text2":"Have a question? Email support is always free; Monday - Friday, 9am - 5pm.","benefit_icon3":"icon-truck2","benefit_title3":"Free UK delivery over £40","benefit_text3":"Fast, securely delivered, tracked next-day United Kingdom delivery from £3.99. Or free when over £40.","benefit_icon4":"icon-star","benefit_title4":"We’re rated 4.9 out of 5","benefit_text4":"Based on over 24,000+ reviews on Trustindex, Trustpilot and Google.","gallery_layout":"stacked","media_size":"medium","mobile_thumbnails":"hide","hide_variants":false,"enable_video_looping":false,"padding_top":34,"padding_bottom":12}},"1694011532c4bc9903":{"type":"apps","blocks":{"ebd12833-d994-456d-af4b-85ab0270bfb4":{"type":"shopify:\/\/apps\/rebuy-personalization-engine\/blocks\/rebuy-widget\/a26ae9b9-933b-40bf-bbc6-bf1220bbc4dc","settings":{"enabled":true,"id":"97947","product_id_enabled":true,"collection_id_enabled":false}}},"block_order":["ebd12833-d994-456d-af4b-85ab0270bfb4"],"settings":{"include_margins":true}},"product-recommendations":{"type":"product-recommendations","disabled":true,"settings":{"heading":"You may also like","color_scheme":"background-1","image_ratio":"square","show_secondary_image":true,"show_vendor":false,"show_rating":false,"padding_top":36,"padding_bottom":28}},"1654193691dfa28cc9":{"type":"how2","settings":{"image_background":"shopify:\/\/shop_images\/why-bg.png","title":"How to place an order for {{ product.title }}","title1":"Checkout online","text1":"<p>Add your {{ product.title }} to the cart and checkout securely using our express checkout online. <\/p>","title2":"Next day delivery","text2":"<p>Once you have placed an order for {{ product.title }} you should receive it the next working day if you placed the order before 14:00 or the day after if placed after 14:00.<\/p>","title3":"Receive your {{ product.title }}","text3":"<p>It is that straightforward, you will now receive your order to the comfort of your home or delivery address. <\/p>","padding_top":36,"padding_bottom":36}},"97481e6c-22b0-4cec-9542-f5bd930868b2":{"type":"simple_text","blocks":{"template--15460049616989__97481e6c-22b0-4cec-9542-f5bd930868b2-1682876312ae12cace-0":{"type":"heading","settings":{"heading":"Buy {{ product.title }} Online"}},"template--15460049616989__97481e6c-22b0-4cec-9542-f5bd930868b2-1682876312ae12cace-1":{"type":"text","settings":{"text":"{{ product.metafields.custom.detailed_seo | metafield_tag }}<p>Please note the information below is intended for general knowledge, please read the manufacturer guidelines and\/or the information provided by a healthcare professional for more specific guidance. This information should not substitute medical advice. <\/p><p>Buy {{ product.title }} online with Welzo and receive your order with express shipping directly to your address of choice. Welzo is the UK's leading online pharmacy and home health testing platform, with over 3000 items available online. Welzo is an approved seller of {{ product.title }}. Order {{ product.title }} to the comfort of your home. <\/p><h2>{{ product.title }} Ingredients<\/h2>{{ product.metafields.custom.product_ingredients | metafield_tag }}<p>{{ product.title }} ingredient lists may change due to formula updates. For the latest ingredients, consult the product leaflet.<\/p><h3>Can I buy {{ product.title }} in the UK?<\/h3><p>Yes, {{ product.title }} is available to purchase in the United Kingdom. You will be able to purchase {{ product.title }} both from your local store\/pharmacy or online. <\/p><h3>Where can I buy {{ product.title }}?<\/h3><p>You can buy {{ product.title }} online and in-store from your local pharmacy. {{ product.title }} is also available with express shipping from Welzo.com.<\/p><h3>How to use {{ product.title }}<\/h3><p>To use {{ product.title }} correctly, it is important to follow the instructions\/information leaflet that comes with the product. Read all of the information thoroughly before taking the product. If you have any further questions about how to take {{ product.title }}, please contact Welzo via the help centre and we will be happy to help.<\/p><h3>What is {{ product.title }}?<\/h3><p>For more information on {{ product.title }}  scroll up to the description at the top of the product page which will give more insight into what  {{ product.title }} is.<\/p><h3>What is the shelf life of {{ product.title }}?<\/h3><p>The shelf life of {{ product.title }} can be determined by reading the expiry date on the product itself. Other factors such as storage conditions can impact the shelf life of {{ product.title }}.<\/p>"}}},"block_order":["template--15460049616989__97481e6c-22b0-4cec-9542-f5bd930868b2-1682876312ae12cace-0","template--15460049616989__97481e6c-22b0-4cec-9542-f5bd930868b2-1682876312ae12cace-1"],"settings":{"padding_top":40,"padding_bottom":20}},"692d8027-9041-4a53-a4dc-81ef6b2c317e":{"type":"simple_text","blocks":{"template--15460049616989__692d8027-9041-4a53-a4dc-81ef6b2c317e-1682942944fffb7e10-0":{"type":"heading","settings":{"heading":""}},"template--15460049616989__692d8027-9041-4a53-a4dc-81ef6b2c317e-1682942944fffb7e10-1":{"type":"text","settings":{"text":"<h3>How should I store {{ product.title }}?<\/h3><p>{{ product.title }} should be stored as per the manufacturer guidelines and information leaflet that comes with the product packaging. <\/p><p>When storing {{ product.title }}, it is crucial to follow the guidelines listed below in order to ensure the safety and effectiveness of the medicine:<\/p><ol><li>Read the label of {{ product.title }}: Always read the label and\/ or manufacturer guidelines that comes with  {{ product.title }} for specific storage instructions, as different products may require unique conditions.<\/li><li>Keep in a cool, dry place: Generally, most OTC medications should be stored in a cool, dry place, away from direct sunlight, heat, and moisture. Avoid storing medicines in a bathroom cabinet or near a radiator, as temperature and humidity fluctuations may affect their potency.<\/li><li>Maintain proper temperature: The ideal temperature for storing most medications is between 15°C and 25°C. If a specific temperature range is recommended on the label of {{ product.title }}, make sure to follow it closely.<\/li><li>Use original packaging of {{ product.title }}: Keep the medication in its original container or packaging, which often provides protection from light and moisture. Additionally, original packaging usually contains important information such as the expiry date, dosage instructions, and potential side effects.<\/li><li>Keep out of reach of children: Store medications in a secure location that is out of sight and reach of children to prevent accidental ingestion or misuse.<\/li><li>Monitor expiry dates: Regularly check the expiry dates of your OTC medications and dispose of any expired or unused medication safely, in accordance with local regulations or your pharmacist's advice.<\/li><\/ol><h3>How should I take {{ product.title }}?<\/h3><p>When taking {{ product.title }}, it is essential to follow the guidelines below to ensure safety and achieve the desired results:<\/p><ol><li>Read the label: Carefully read the label or enclosed leaflet that comes with the {{ product.title }} for specific instructions on dosage, frequency, and any potential side effects or interactions.<\/li><li>Follow dosage recommendations: Adhere to the recommended dosage and avoid taking more than the suggested amount, as this may lead to adverse effects or reduced effectiveness.<\/li><li>Take with or without food: Some medications or supplements may require consumption with food to aid in absorption or prevent stomach irritation, while others should be taken on an empty stomach. Follow the instructions provided on the label or leaflet of {{ product.title }}.<\/li><li>Be mindful of timing: Take the medication or supplement at the specified intervals or times of day, as recommended on the label, to ensure optimal effectiveness.<\/li><li>Check for interactions: If you are taking multiple medications or supplements, consult your pharmacist or healthcare professional to ensure there are no potential interactions that could affect their efficacy or cause adverse effects.<\/li><li>Monitor side effects: If you experience any unusual or severe side effects while taking the medication or supplement, discontinue use and consult your healthcare professional immediately.<\/li><li>Seek professional advice: If you have any concerns or questions about taking a specific medication or supplement, consult your pharmacist or healthcare professional for further guidance.<\/li><\/ol><h3>What are the side effects of {{ product.title }}?<\/h3><p>The side effects of an over-the-counter (OTC) medication or supplement can be diverse, and may include mild, moderate, or severe reactions. <\/p><p>If you are taking {{ product.title }} for the first time, it is important to monitor any adverse or allergic reactions. Ensure you are not allergic to any of the ingredients in {{ product.title }} before taking. If you experience an allergic reaction please discontinue use of {{ product.title }} and seek immediate medical attention.<\/p><p>For information on the specific side effects of {{ product.title }} read the information leaflet\/label  that comes with {{ product.title }}. <\/p><p>It is important to note that not everyone will experience side effects, and the severity or type of side effects may differ from person to person. Factors such as individual sensitivity, dosage, and interactions with other medications or supplements can influence the occurrence and intensity of side effects.<\/p><p>If you encounter any concerning side effects while taking {{ product.title }}, stop using the product and consult a healthcare professional promptly. They can advise you on whether it is safe to continue using the product or recommend an alternative treatment.<\/p><p>Always consult a pharmacist or healthcare professional before starting any new OTC medication or supplement, particularly if you have pre-existing health conditions, are pregnant or breastfeeding, or are taking other medications.<\/p><h3>How does {{ product.title }} work?<\/h3><p>The way an over-the-counter (OTC) medication or supplement works depends on the active ingredients it contains, as well as the intended purpose of the product. Generally, OTC medications and supplements are formulated to target specific symptoms, conditions, or to support overall health and well-being.<\/p><h4>Can {{ product.title }} be used by children and infants?<\/h4><p>Read the information leaflet\/label of {{ product.title }} to find out if it can be used by children\/infants. Furthermore, it depends on various factors, including the child's age, weight, health conditions, and the specific product in question. It is essential to exercise caution when administering any medication or supplement to a child.<\/p><ol><li>Read the label: Carefully examine the label or enclosed leaflet of the {{ product.title }} for information on age restrictions, dosages, and any specific warnings or contraindications for children.<\/li><li>Age-appropriate products: Some OTC medications and supplements are specifically formulated for children, with adjusted dosages and child-friendly forms, such as chewable tablets, liquid suspensions, or gummies. Opt for these products when available and follow the instructions provided for the child's age group.<\/li><li>Consult a healthcare professional: If you are unsure whether {{ product.title }} is suitable for your child, it is always best to consult a pharmacist, doctor, or paediatrician for advice. They can provide guidance on the appropriateness, dosage, and potential side effects of the product for your child.<\/li><li>Monitor for side effects: Children may be more susceptible to side effects or adverse reactions from medications or supplements. Closely observe your child for any signs of side effects or discomfort,  discontinue use and consult a healthcare professional if you have any concerns.<\/li><\/ol><h3>Can I buy {{ product.title }} from Boots?<\/h3><p>It is generally possible to purchase over-the-counter medication, including {{ product.title }}, from UK pharmacies like Boots. However, I recommend checking the Boots website or contacting Boots directly for the most current and accurate information. Remember to consult with a healthcare professional before starting any new medication.<\/p><h3>Can I buy {{ product.title }} from Superdrug?<\/h3><p>If you would like to buy {{ product.title }}, you will need to check availability on the Superdrug website. <\/p><h4>Can I buy {{ product.title }} from Amazon?<\/h4><p>Amazon does not always sell all over the counter products such as {{ product.title }}, that we offer, as they are not a pharmacy service provider. Always check with Amazon to see if they offer {{ product.title }}<\/p>"}}},"block_order":["template--15460049616989__692d8027-9041-4a53-a4dc-81ef6b2c317e-1682942944fffb7e10-0","template--15460049616989__692d8027-9041-4a53-a4dc-81ef6b2c317e-1682942944fffb7e10-1"],"settings":{"padding_top":20,"padding_bottom":36}},"165346922221a5012f":{"type":"faq","blocks":{"1653469222a4a027b4-0":{"type":"column","settings":{"title":"Specific","text":""}},"7246161a-a3c2-4391-aff6-bdbcffa3cdb5":{"type":"column","settings":{"title":"Specific","text":""}},"b37db117-cfe4-49e7-9cba-127f78875786":{"type":"column","settings":{"title":"Specific","text":""}},"05bf8b0d-14d4-4b22-bcab-ce5c7d6a76eb":{"type":"column","settings":{"title":"Specific","text":""}},"8c2be819-f783-49fc-befe-414ccd39d703":{"type":"column","settings":{"title":"Is this medication suited for me?","text":"<p>Please get in touch with a doctor if you are unsure what medication is suitable for you. You can also complete our online consultation form to check your eligibility for the product.<\/p>"}},"24e11988-ce58-4fe8-846c-10a329d7fd8c":{"type":"column","settings":{"title":"How do I order my medication?","text":"<p>Some products only require an online consultation which approximately takes 1 minute to complete, enabling you to then buy the product. Other products will also require a prescription; in this case, you will need to complete the online consultation, and then one of our partner pharmacy prescribers or doctors will review the online consultation questions and approve the order for delivery if you are eligible to purchase the item.<\/p>"}},"48abf10e-1d54-4a71-b5be-05e9c0435fe7":{"type":"column","settings":{"title":"How is the medication delivered?","text":"<p>All orders placed before 14:00 from Monday to Friday will be dispatched that day. The orders are sent using 24 Hour Tracked delivery provided by Royal Mail. Items will usually arrive the very next day after the order has been placed. We also provide tracking for your orders to check the status and location of your parcel. All our medication is packaged in plain confidential padded white or brown envelopes. This ensures that your orders are discreet, and the content of the orders will be for your eyes only.<\/p>"}},"b65e598c-af5f-4d72-b40e-ea0e0048856a":{"type":"column","settings":{"title":"Can I cancel or return my order?","text":"<p>For non-medicinal products, you are eligible to return the product within 14 days of receipt in the same packaging you received. For medicinal products, you are eligible to cancel the order only until it has been dispatched. From that point forward, you are no longer eligible to return the order.<\/p><p>You have the right to cancel your order for medication up to the point when your medication is dispatched.<\/p>"}}},"block_order":["1653469222a4a027b4-0","7246161a-a3c2-4391-aff6-bdbcffa3cdb5","b37db117-cfe4-49e7-9cba-127f78875786","05bf8b0d-14d4-4b22-bcab-ce5c7d6a76eb","8c2be819-f783-49fc-befe-414ccd39d703","24e11988-ce58-4fe8-846c-10a329d7fd8c","48abf10e-1d54-4a71-b5be-05e9c0435fe7","b65e598c-af5f-4d72-b40e-ea0e0048856a"],"settings":{"faq_section_show":true,"title":"Frequently Asked Questions","page_width":1090,"padding_top":32,"padding_bottom":100}},"16534182831dc0cb7b":{"type":"why","blocks":{"1653418283e408e0b5-0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon_5.png","title":"Convenient and fast","text":"<p>Welzo over the counter products are shipped out for next day delivery if placed before 14:00. <\/p>"}},"e902f2b1-2263-43e5-a679-7c1f7648190b":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon_6.png","title":"UK Based Pharmacy","text":"<p>We only work with UK based pharmacies. All of our pharmacy partners are registered with GPhC.<\/p>"}},"8ed7e7d7-cb80-42f0-bff9-9cc2bfa71a75":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/Icon_7.png","title":"Rated 4.9\/5 on Trustindex","text":"<p>We are rated 4.9 out of 5 by over 23,000 customers online. Making us the highest rated online pharmacy in the UK.<\/p>"}}},"block_order":["1653418283e408e0b5-0","e902f2b1-2263-43e5-a679-7c1f7648190b","8ed7e7d7-cb80-42f0-bff9-9cc2bfa71a75"],"settings":{"image_background":"shopify:\/\/shop_images\/base11.jpg","image_logos":"shopify:\/\/shop_images\/logos.png","title":"Why Welzo","padding_top":100,"padding_bottom":100}},"1682818256a75ee81a":{"type":"apps","blocks":{"3f9a2702-4576-47cd-acfa-2f10b4690c04":{"type":"shopify:\/\/apps\/judge-me-reviews\/blocks\/review_widget\/61ccd3b1-a9f2-4160-9fe9-4fec8413e5d8","settings":{}}},"block_order":["3f9a2702-4576-47cd-acfa-2f10b4690c04"],"settings":{"include_margins":true}},"7dba965f-2f07-426b-8cb0-0d986606d5d3":{"type":"multicolumn","blocks":{"template--15460049616989__7dba965f-2f07-426b-8cb0-0d986606d5d3-168296890729ea5f21-0":{"type":"column","settings":{"title":"","text":"{{ product.metafields.custom.related_services | metafield_tag }}","link_label":"","link":""}},"template--15460049616989__7dba965f-2f07-426b-8cb0-0d986606d5d3-168296890729ea5f21-1":{"type":"column","settings":{"title":"","text":"{{ product.metafields.custom.related_articles | metafield_tag }}","link_label":"","link":""}}},"block_order":["template--15460049616989__7dba965f-2f07-426b-8cb0-0d986606d5d3-168296890729ea5f21-0","template--15460049616989__7dba965f-2f07-426b-8cb0-0d986606d5d3-168296890729ea5f21-1"],"settings":{"title":"","image_width":"full","image_ratio":"adapt","column_alignment":"left","background_style":"primary","button_label":"","button_link":"","swipe_on_mobile":false,"color_scheme":"background-1","padding_top":36,"padding_bottom":36}},"112a8910-6f6d-4733-83c3-663dc43141f8":{"type":"simple_text","blocks":{"template--15460049616989__112a8910-6f6d-4733-83c3-663dc43141f8-1682904017dcb3e43e-0":{"type":"heading","settings":{"heading":""}},"template--15460049616989__112a8910-6f6d-4733-83c3-663dc43141f8-1682904017dcb3e43e-1":{"type":"text","settings":{"text":"{{ product.metafields.custom.text1 | metafield_tag }}"}}},"block_order":["template--15460049616989__112a8910-6f6d-4733-83c3-663dc43141f8-1682904017dcb3e43e-0","template--15460049616989__112a8910-6f6d-4733-83c3-663dc43141f8-1682904017dcb3e43e-1"],"settings":{"padding_top":40,"padding_bottom":52}}},"order":["main","1694011532c4bc9903","product-recommendations","1654193691dfa28cc9","97481e6c-22b0-4cec-9542-f5bd930868b2","692d8027-9041-4a53-a4dc-81ef6b2c317e","165346922221a5012f","16534182831dc0cb7b","1682818256a75ee81a","7dba965f-2f07-426b-8cb0-0d986606d5d3","112a8910-6f6d-4733-83c3-663dc43141f8"]}